<html xmlns:v="urn:schemas-microsoft-com:vml" xmlns:o="urn:schemas-microsoft-com:office:office" xmlns="http://www.w3.org/TR/REC-html40">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<link rel="File-List" href="1.files/filelist.xml">
<title>&#1051;&#1077;&#1082;&#1094;&#1080;&#1103 1</title>
<style>
<!--
p.MsoPlainText
	{margin-bottom:.0001pt;
	text-align:justify;
	text-indent:35.45pt;
	font-size:14.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
p.a0
	{margin-bottom:.0001pt;
	font-size:12.0pt;
	font-family:"Courier New";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
 table.MsoNormalTable
	{mso-style-parent:"";
	font-size:10.0pt;
	font-family:"Times New Roman","serif"}
p.Normal
	{mso-style-parent:"";
	margin-bottom:.0001pt;
	text-align:justify;
	text-indent:15.0pt;
	font-size:11.0pt;
	font-family:"Times New Roman","serif";
	layout-grid-mode:line; margin-left:0cm; margin-right:0cm; margin-top:0cm}
 p.MsoNormal
	{mso-style-parent:"";
	margin-bottom:.0001pt;
	font-size:10.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
p.MsoBodyText2
	{margin-bottom:.0001pt;
	font-size:14.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
-->
</style>
<!--[if !mso]>
<style>
v\:*         { behavior: url(#default#VML) }
o\:*         { behavior: url(#default#VML) }
.shape       { behavior: url(#default#VML) }
</style>
<![endif]--><!--[if gte mso 9]>
<xml><o:shapedefaults v:ext="edit" spidmax="1027"/>
</xml><![endif]-->
</head>

<body>

<p class="MsoPlainText"><b>1. &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; 8086</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1081; &#1073;&#1083;&#1086;&#1082; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;: &#1073;&#1083;&#1086;&#1082; 
&#1087;&#1080;&#1090;&#1072;&#1085;&#1080;&#1103;; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1091;&#1102; (&#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1085;&#1089;&#1082;&#1091;&#1102;) &#1087;&#1083;&#1072;&#1090;&#1091;; &#1072;&#1076;&#1072;&#1087;&#1090;&#1077;&#1088;&#1099; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;; &#1085;&#1072;&#1082;&#1086;&#1087;&#1080;&#1090;&#1077;&#1083;&#1080; 
&#1085;&#1072; &#1078;&#1077;&#1089;&#1090;&#1082;&#1080;&#1093; &#1084;&#1072;&#1075;&#1085;&#1080;&#1090;&#1085;&#1099;&#1093; (&#1053;&#1046;&#1052;&#1044;) &#1080; &#1075;&#1080;&#1073;&#1082;&#1080;&#1093; (&#1053;&#1043;&#1052;&#1044;) &#1076;&#1080;&#1089;&#1082;&#1072;&#1093;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1103;&#1076; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; 
&#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;. &#1044;&#1083;&#1103; &#1085;&#1072;&#1089; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1072;&#1103; &#1087;&#1083;&#1072;&#1090;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; 
&#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1077; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1055;&#1047;&#1059; (<span lang="EN-US">ROM</span> 
- <span lang="EN-US">read only memory</span>), &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1077; 
&#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1054;&#1047;&#1059; (<span lang="EN-US">RAM</span> - <span lang="EN-US">random access 
memory</span>), &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1080; &#1083;&#1086;&#1075;&#1080;&#1082;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081; &#1096;&#1080;&#1085;&#1072;&#1084;&#1080;.</p>
<p class="MsoPlainText">&#1060;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080; &#1054;&#1047;&#1059; &#1080; &#1055;&#1047;&#1059; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099; &#1074; &#1074;&#1080;&#1076;&#1077; &#1084;&#1080;&#1082;&#1088;&#1086;&#1089;&#1093;&#1077;&#1084;. 
&#1061;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1090; &#1092;&#1072;&#1082;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080; &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1080; 
&#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1087;&#1080;&#1090;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1054;&#1047;&#1059; &#1091;&#1090;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; (&#1101;&#1085;&#1077;&#1088;&#1075;&#1086;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1072;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;), &#1072; &#1055;&#1047;&#1059; – &#1085;&#1077;&#1090; 
(&#1101;&#1085;&#1077;&#1088;&#1075;&#1086;&#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1072;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;). </p>
<p class="MsoPlainText">&#1054;&#1076;&#1085;&#1072; &#1080;&#1079; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1079;&#1072;&#1076;&#1072;&#1095; &#1055;&#1047;&#1059; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1091; &#1089;&#1090;&#1072;&#1088;&#1090;&#1072; 
&#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;. &#1042; &#1055;&#1047;&#1059; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1074;&#1074;&#1086;&#1076;&#1072;/&#1074;&#1099;&#1074;&#1086;&#1076;&#1072; BIOS, &#1072; 
&#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1083;&#1091;&#1078;&#1077;&#1073;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1095;&#1080;&#1082;, 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <span lang="EN-US">POST </span>&#1080; &#1090;.&#1087;. </p>
<p class="MsoPlainText">&#1054;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1072;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1054;&#1047;&#1059; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1076;&#1083;&#1103; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; 
&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1086;&#1085;&#1080; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1080;&#1088;&#1091;&#1102;&#1090;. &#1051;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1091;&#1102; 
&#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1103;&#1095;&#1077;&#1077;&#1082;,<span style="color: lime">
</span>&#1082;&#1072;&#1078;&#1076;&#1072;&#1103; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1084;. </p>
<p class="MsoPlainText">&#1062;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; (&#1062;&#1055;) &#1074; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; 
&#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;&#1093; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1074; &#1074;&#1080;&#1076;&#1077; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1074;&#1077;&#1088;&#1093;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1084;&#1080;&#1082;&#1088;&#1086;&#1089;&#1093;&#1077;&#1084;&#1099; (&#1057;&#1041;&#1048;&#1057;). 
&#1062;&#1055; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1103; &#1080;&#1093; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1079; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1074;&#1089;&#1077;&#1093; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1099;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; 
&#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;&#1084;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1074;&#1099;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084;&#1080; &#1062;&#1055; &#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1057;&#1041;&#1048;&#1057;, &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;&#1084;&#1080; 
&#1090;&#1072;&#1082;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;.</p>
<p class="MsoPlainText">&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1090; &#1086;&#1090; &#1090;&#1080;&#1087;&#1072; 
&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1080; &#1077;&#1075;&#1086; &#1090;&#1072;&#1082;&#1090;&#1086;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1099;. &#1057;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; 80&#1093;86 
&#1082;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1094;&#1080;&#1080; <span lang="EN-US">Intel </span>&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074; &#1089;&#1077;&#1073;&#1103; &#1084;&#1080;&#1082;&#1088;&#1086;&#1089;&#1093;&#1077;&#1084;&#1099;: 8086, 
80186, 80286, 80386, 80486, <span lang="EN-US">Pentium</span>,
<span lang="EN-US">Pentium II</span>, <span lang="EN-US">Pentium III Pentium IV
</span>&#1080;<span style="color: lime"> </span>&#1090;.&#1076;. &#1057;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1089; 80&#1093;86 &#1084;&#1080;&#1082;&#1088;&#1086;&#1089;&#1093;&#1077;&#1084;&#1099; 
&#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072;&#1102;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1092;&#1080;&#1088;&#1084;&#1099; <span lang="EN-US">AMD</span>, <span lang="EN-US">IBM</span>,
<span lang="EN-US">Cyrix</span>. &#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1101;&#1090;&#1080;&#1093; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; 
&#1087;&#1088;&#1077;&#1077;&#1084;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;: &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1084;&#1083;&#1072;&#1076;&#1096;&#1080;&#1093; 
&#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;, &#1073;&#1077;&#1079; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099; &#1085;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; 
&#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1103;&#1093;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; 8086, 
&#1079;&#1085;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1081; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; &#1076;&#1083;&#1103; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; 
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;.</p>
<p class="MsoPlainText">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; <span lang="EN-US">
Intel </span>8086 &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1076;&#1074;&#1072; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1073;&#1083;&#1086;&#1082;&#1072; (&#1088;&#1080;&#1089;.1.1):</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span lang="EN-US" style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1073;&#1083;&#1086;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;<span lang="EN-US"> (EU:Execution Unit);</span></p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span lang="EN-US" style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1073;&#1083;&#1086;&#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1096;&#1080;&#1085;<span lang="EN-US"> (BIU:Bus Interface Unit).</span></p>
<p class="MsoPlainText">(&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; (interface) - &#1101;&#1090;&#1086; &#1089;&#1086;&#1074;&#1086;&#1082;&#1091;&#1087;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;, 
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093;<span style="color: lime"> </span>&#1089;&#1086;&#1087;&#1088;&#1103;&#1078;&#1077;&#1085;&#1080;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1080; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1082;&#1072;&#1082; &#1085;&#1072; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;, &#1090;&#1072;&#1082; &#1080; &#1085;&#1072; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;&#1093;).</p>
<p class="MsoPlainText">&#1042; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; EU &#1074;&#1093;&#1086;&#1076;&#1103;&#1090;: &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;-&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; 
ALU, &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; CU (<span lang="EN-US">Control Unit</span>) &#1080; &#1076;&#1077;&#1089;&#1103;&#1090;&#1100; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;. &#1059;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1073;&#1083;&#1086;&#1082;&#1072; EU &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; 
&#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;.</p>
<p class="MsoPlainText">&#1058;&#1088;&#1080; &#1095;&#1072;&#1089;&#1090;&#1080; &#1073;&#1083;&#1086;&#1082;&#1072; BIU - &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1096;&#1080;&#1085;&#1072;&#1084;&#1080;, &#1073;&#1083;&#1086;&#1082; 
&#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; – &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; 
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;:</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1084;&#1077;&#1085;&#1086;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1089; EU, &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&#1102; &#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084;&#1080; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; 
&#1074;&#1074;&#1086;&#1076;&#1072;/&#1074;&#1099;&#1074;&#1086;&#1076;&#1072;;</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;;</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; (&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1073;&#1083;&#1086;&#1082;&#1072; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; 
Queue, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1089; &#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084;). </p>
<p class="MsoPlainText"><span style="color: lime">&nbsp;</span></p>
<p class="MsoPlainText"><!--[if gte vml 1]><v:shapetype id="_x0000_t75"
 coordsize="21600,21600" o:spt="75" o:preferrelative="t" path="m@4@5l@4@11@9@11@9@5xe"
 filled="f" stroked="f">
 <v:stroke joinstyle="miter"/>
 <v:formulas>
  <v:f eqn="if lineDrawn pixelLineWidth 0"/>
  <v:f eqn="sum @0 1 0"/>
  <v:f eqn="sum 0 0 @1"/>
  <v:f eqn="prod @2 1 2"/>
  <v:f eqn="prod @3 21600 pixelWidth"/>
  <v:f eqn="prod @3 21600 pixelHeight"/>
  <v:f eqn="sum @0 0 1"/>
  <v:f eqn="prod @6 1 2"/>
  <v:f eqn="prod @7 21600 pixelWidth"/>
  <v:f eqn="sum @8 21600 0"/>
  <v:f eqn="prod @7 21600 pixelHeight"/>
  <v:f eqn="sum @10 21600 0"/>
 </v:formulas>
 <v:path o:extrusionok="f" gradientshapeok="t" o:connecttype="rect"/>
 <o:lock v:ext="edit" aspectratio="t"/>
</v:shapetype><v:shape id="_x0000_s1044" type="#_x0000_t75" style='width:309.75pt;
 height:354pt' fillcolor="window">
 <v:imagedata src="1.files/image001.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=413 height=472
src="1.files/image002.gif" v:shapes="_x0000_s1044"><![endif]><!--[if gte mso 9]><![endif]--></p>
<p class="MsoPlainText">&#1058;&#1088;&#1080; &#1095;&#1072;&#1089;&#1090;&#1080; &#1073;&#1083;&#1086;&#1082;&#1072; BIU - &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1096;&#1080;&#1085;&#1072;&#1084;&#1080;, &#1073;&#1083;&#1086;&#1082; 
&#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; – &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; 
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;:</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1084;&#1077;&#1085;&#1086;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1089; EU, &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&#1102; &#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084;&#1080; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; 
&#1074;&#1074;&#1086;&#1076;&#1072;/&#1074;&#1099;&#1074;&#1086;&#1076;&#1072;;</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;;</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; (&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1073;&#1083;&#1086;&#1082;&#1072; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; 
Queue, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1089; &#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084;). </p>
<p class="MsoPlainText">&#1057; &#1090;&#1086;&#1095;&#1082;&#1080; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072;, &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; 8086 &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; 8 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, 4 &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;, &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; 
(&#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;) &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074;. &#1055;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1074;&#1099;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1085;&#1072;<span style="color: lime">
</span>&#1096;&#1080;&#1085;&#1091; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1072;&#1076;&#1088;&#1077;&#1089; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1084;&#1099;&#1093; &#1080;&#1079; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; (&#1080;&#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
&#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&#1102;&#1090; &#1074; &#1096;&#1077;&#1089;&#1090;&#1080;&#1073;&#1072;&#1081;&#1090;&#1085;&#1099;&#1081; &#1073;&#1091;&#1092;&#1077;&#1088; (&#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;), &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103;.</p>
<p class="MsoPlainText">&#1040;&#1076;&#1088;&#1077;&#1089;&#1085;&#1091;&#1102; &#1096;&#1080;&#1085;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1077; 20 &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1074;, &#1074; 
&#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1086;&#1078;&#1077;&#1090; &#1083;&#1080;&#1073;&#1086; &#1087;&#1088;&#1086;&#1090;&#1077;&#1082;&#1072;&#1090;&#1100; &#1085;&#1072;&#1087;&#1088;&#1103;&#1078;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; (&#1089;&#1080;&#1075;&#1085;&#1072;&#1083; 1), 
&#1083;&#1080;&#1073;&#1086; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; (&#1089;&#1080;&#1075;&#1085;&#1072;&#1083; 0). &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1086;&#1087;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1089; 
&#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1089;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; (&#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;). &#1057;&#1080;&#1084;&#1074;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; 
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1082;&#1086;&#1076;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1082;&#1086;&#1076;&#1086;&#1084; ASCII (&#1040;&#1084;&#1077;&#1088;&#1080;&#1082;&#1072;&#1085;&#1089;&#1082;&#1080;&#1081; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; 
&#1076;&#1083;&#1103; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;). &#1063;&#1080;&#1089;&#1083;&#1086;&#1074;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1076;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1081;<span style="color: red">
</span>&#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1082;&#1086;&#1081;. &#1054;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077;.</p>
<p class="MsoPlainText">&#1052;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103; 
&#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1091;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1073;&#1080;&#1090; (<span lang="EN-US">Bit</span>). &#1043;&#1088;&#1091;&#1087;&#1087;&#1072; &#1080;&#1079; 
&#1074;&#1086;&#1089;&#1100;&#1084;&#1080; &#1073;&#1080;&#1090;&#1086;&#1074; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1073;&#1072;&#1081;&#1090;&#1086;&#1084; (Byte) &#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1100;&#1096;&#1091;&#1102; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1084;&#1091;&#1102; 
&#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091; – &#1103;&#1095;&#1077;&#1081;&#1082;&#1091; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. &#1041;&#1080;&#1090;&#1099; &#1074; &#1073;&#1072;&#1081;&#1090;&#1077; &#1085;&#1091;&#1084;&#1077;&#1088;&#1091;&#1102;&#1090; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1085;&#1072;&#1083;&#1077;&#1074;&#1086; &#1094;&#1080;&#1092;&#1088;&#1072;&#1084;&#1080; 0...7.</p>
<p class="a0"><span lang="EN-US">BYTE</span></p>
<table class="MsoNormalTable" border="1" cellspacing="0" cellpadding="0" style="border-collapse: collapse; border: medium none; margin-left: 5.4pt">
	<tr>
		<td width="42" valign="top" style="width: 31.85pt; border: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">7</span></td>
		<td width="43" valign="top" style="width: 31.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">6</span></td>
		<td width="43" valign="top" style="width: 31.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">5</span></td>
		<td width="43" valign="top" style="width: 31.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">4</span></td>
		<td width="43" valign="top" style="width: 31.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">3</span></td>
		<td width="43" valign="top" style="width: 31.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">2</span></td>
		<td width="43" valign="top" style="width: 31.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">1</span></td>
		<td width="43" valign="top" style="width: 31.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">0</span></td>
	</tr>
</table>
<p class="MsoPlainText">&#1044;&#1074;&#1091;&#1093;&#1073;&#1072;&#1081;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1080;&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1077; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;&#1077; 
&#1089;&#1083;&#1086;&#1074;&#1086; (Word), &#1073;&#1080;&#1090;&#1099; &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1085;&#1091;&#1084;&#1077;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090; 0 &#1076;&#1086; 15 &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1085;&#1072;&#1083;&#1077;&#1074;&#1086;. &#1041;&#1072;&#1081;&#1090; &#1089; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1084; 
&#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1084; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1083;&#1072;&#1076;&#1096;&#1080;&#1084;. </p>
<p class="a0"><span lang="EN-US">WORD</span></p>
<table class="MsoNormalTable" border="1" cellspacing="0" cellpadding="0" style="border-collapse: collapse; border: medium none; margin-left: 5.4pt">
	<tr style="page-break-inside: avoid">
		<td width="37" valign="top" style="width: 27.9pt; border: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">15</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">14</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">13</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">12</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">11</span></td>
		<td width="37" valign="top" style="width: 27.95pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">10</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">9</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">8</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">7</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">6</span></td>
		<td width="37" valign="top" style="width: 27.95pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">5</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">4</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">3</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">2</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">1</span></td>
		<td width="37" valign="top" style="width: 27.95pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">0</span></td>
	</tr>
</table>
<p class="MsoPlainText">&#1063;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093;&#1073;&#1072;&#1081;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090; &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086; (<span lang="EN-US">Double 
Word</span>), &#1072; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1080;&#1073;&#1072;&#1081;&#1090;&#1086;&#1074;&#1086;&#1077; – &#1087;&#1072;&#1088;&#1072;&#1075;&#1088;&#1072;&#1092; (<span lang="EN-US">Paragraph</span>).</p>
<p class="MsoPlainText">&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; 16-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1081; &#1096;&#1080;&#1085;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; 
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0 (&#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;&#1093; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; 0) &#1076;&#1086; 65535 (&#1074;&#1086; &#1074;&#1089;&#1077;&#1093; 
&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;&#1093; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; 1). &#1053;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; 
&#1085;&#1072;&#1075;&#1083;&#1103;&#1076;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1086;&#1085;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1082; – &#1095;&#1080;&#1089;&#1083;&#1072;, &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1081; 
&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1075;&#1088;&#1086;&#1084;&#1086;&#1079;&#1076;&#1082;&#1080;. &#1057; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1087;&#1088;&#1080;&#1074;&#1099;&#1095;&#1085;&#1072;&#1103; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1072;&#1103; 
&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1089;&#1083;&#1086;&#1078;&#1085;&#1072; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1095;&#1080;&#1089;&#1077;&#1083; &#1074; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1089;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; 
&#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1072; 
&#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1089;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;.</p>
<p class="MsoPlainText">&#1055;&#1088;&#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; 
&#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1078;&#1076;&#1072;&#1090;&#1100; &#1083;&#1072;&#1090;&#1080;&#1085;&#1089;&#1082;&#1086;&#1081; &#1073;&#1091;&#1082;&#1074;&#1086;&#1081; B &#1080;&#1083;&#1080; b, (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 101B), &#1072; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1099;&#1077; – 
&#1073;&#1091;&#1082;&#1074;&#1086;&#1081; H &#1080;&#1083;&#1080; h &#1085;&#1072; &#1082;&#1086;&#1085;&#1094;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1095;&#1080;&#1089;&#1083;&#1086; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1073;&#1091;&#1082;&#1074;&#1099;, &#1090;&#1086; &#1074;&#1087;&#1077;&#1088;&#1077;&#1076;&#1080; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; 
&#1087;&#1088;&#1080;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1091;&#1083;&#1100;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 0BA8H.</p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText"><b>&nbsp;</b></p>
<p class="MsoPlainText"><b>1.1. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;
</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1042; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; 8086 &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; 14 &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1080;&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1099;&#1093; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;. &#1055;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1099; 80386, 
80486 &#1080; <span lang="EN-US">Pentium</span> &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; 32-&#1073;&#1080;&#1090;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; 
&#1080; &#1082;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086; &#1080;&#1084;&#1077;&#1102;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;, &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1099; 
&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;.</p>
<p class="MsoPlainText">&#1042;&#1089;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;:</p>
<p class="Normal" style="text-indent: 35.45pt"><b><i>
<span style="font-size: 14.0pt">&#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;.</span></i></b><span style="font-size: 14.0pt"> 
&#1050; &#1085;&#1080;&#1084; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103; 16-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1040;&#1061;, &#1042;&#1061;, &#1057;&#1061;, </span>
<span lang="EN-US" style="font-size: 14.0pt">DX</span><span style="font-size: 14.0pt">.</span></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt">&#1042; 
&#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1072;&#1103; &#1090;&#1077;&#1084; &#1080;&#1083;&#1080; &#1080;&#1085;&#1099;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;­&#1088;&#1086;&#1084;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1084;&#1080;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084;<span style="color: lime">
</span>&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1084; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1077; &#1077;&#1075;&#1086; &#1079;&#1085;&#1072;­&#1095;&#1077;&#1085;&#1080;&#1077;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; 
&#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1085;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1082;&#1072;&#1078;­&#1076;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;:</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1072;&#1082;&#1082;&#1091;&#1084;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1093; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1080; &#1087;&#1088;&#1080; 
&#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1087;&#1086;&#1088;&#1090;&#1072;&#1084;&#1080; &#1074;&#1074;&#1086;&#1076;&#1072;-&#1074;&#1099;&#1074;&#1086;&#1076;&#1072; (&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; </span>
<span lang="EN-US" style="font-size: 14.0pt">in</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">out</span><span style="font-size: 14.0pt">).
</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1073;&#1072;&#1079;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;,&nbsp; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
&#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">CX</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1093; &#1076;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1095;&#1080;&#1089;&#1083;&#1072; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1077;&#1085;&#1080;&#1081;, 
&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; &#1094;&#1080;&#1082;&#1083;&#1072;&#1093;, &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093; &#1080; &#1090;.&#1087;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">DX </span>
<span style="font-size: 14.0pt">&#1080;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1093; 
&#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1077;&#1083;&#1103; &#1072;&#1082;&#1082;&#1091;&#1084;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088;&#1072;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; </span>
<span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">CX</span><span style="font-size: 14.0pt">, 
&#1080; </span><span lang="EN-US" style="font-size: 14.0pt">DX</span><span style="font-size: 14.0pt"> 
&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082; &#1080;&#1093; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1081; &#1080; &#1084;&#1083;&#1072;&#1076;&#1096;&#1077;&#1081; &#1087;&#1086;&#1083;&#1086;&#1074;&#1080;&#1085;&#1077;. &#1057;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; 
&#1087;&#1086;&#1076;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074;&#1086;&#1089;&#1100;&#1084;&#1080;&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1099;&#1084;&#1080; &#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1080;&#1084;&#1077;&#1085;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">AH</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">AL</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">BH</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">BL</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">CH</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">CL</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">DH</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">DL</span><span style="font-size: 14.0pt">.</span></p>
<p class="Normal" style="text-indent: 35.45pt"><b><i>
<span style="font-size: 14.0pt">&#1040;&#1076;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;.</span></i></b><span style="font-size: 14.0pt"> 
&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; 16-&#1073;&#1080;&#1090;&#1086;&#1074;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074;. &#1069;&#1090;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;: </span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">, 
&#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; (&#1086;&#1085; &#1078;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;), </span>
<span lang="EN-US" style="font-size: 14.0pt">SI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt"> 
&#1080; </span><span lang="EN-US" style="font-size: 14.0pt">BP</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">SI</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;, &#1082;&#1072;&#1082; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">, 
&#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &nbsp;&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;,&nbsp; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; 
&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1089;&#1086; 
&#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1084;&#1080; &#1074; &#1101;&#1090;&#1086;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072; &#1087;&#1088;&#1080;&#1077;&#1084;&#1085;&#1080;&#1082;&#1072; &#1090;&#1086;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;,&nbsp; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; 
&#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1089;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1084;&#1080; &#1074; &#1101;&#1090;&#1086;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; 
&#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1087;&#1088;&#1080;&#1077;&#1084;&#1085;&#1080;&#1082;&#1072; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">BP</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1073;&#1072;&#1079;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;,&nbsp; 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1089;&#1090;&#1077;&#1082;&#1072;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b><i>&#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089;&#1090;&#1077;&#1082;&#1072;</i></b> . &#1059;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">SP</span><span style="font-size: 14.0pt"> 
– &#1101;&#1090;&#1086; 16-&#1073;&#1080;&#1090;&#1086;&#1074;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1089;&#1090;&#1077;&#1082; &#1080; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; 
&#1080;&#1093; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072;. &#1060;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1089;&#1090;&#1077;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; 
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1085;&#1091;&#1078;&#1085;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;<span style="color: lime">
</span>&#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1084;&#1080; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1086; &#1089;&#1090;&#1077;&#1082;&#1086;&#1084; &#1090;&#1080;&#1087;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">push</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">pop</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">pushf</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">popf</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">call</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">ret</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1042;&#1089;&#1077; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1076;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1099; &#1076;&#1083;&#1103; 
&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1087;&#1088;&#1103;&#1084;&#1086;&#1084;&#1091; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b><i>&#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;.</i></b> &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">IP</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081;<span style="color: lime">
</span>&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;
</span><span lang="EN-US" style="font-size: 14.0pt">IP</span><span style="font-size: 14.0pt"> 
&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1077;&#1077; &#1076;&#1083;&#1080;&#1085;&#1091; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1091;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;. &#1053;&#1072;&#1088;&#1091;&#1096;&#1072;&#1102;&#1090; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074; 
(&#1086;&#1085;&#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1073;&#1091;&#1082;&#1074;&#1099; </span><span lang="EN-US" style="font-size: 14.0pt">j
</span><span style="font-size: 14.0pt">&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; </span>
<span lang="EN-US" style="font-size: 14.0pt">jxx</span><span style="font-size: 14.0pt">), 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; (</span><span lang="EN-US" style="font-size: 14.0pt">call</span><span style="font-size: 14.0pt">), 
&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; (</span><span lang="EN-US" style="font-size: 14.0pt">int</span><span style="font-size: 14.0pt">) 
&#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; (</span><span lang="EN-US" style="font-size: 14.0pt">ret</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">iret</span><span style="font-size: 14.0pt">). 
&#1053;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; </span><span lang="EN-US" style="font-size: 14.0pt">
IP</span><span style="font-size: 14.0pt"> &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;. 
&#1050;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">IP</span><span style="font-size: 14.0pt"> 
&#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1080;&#1076;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">jxx</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">call</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">int</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">ret</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">iret</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b><i>&#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;.</i></b> &#1050; &#1085;&#1080;&#1084; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103; </span>
<span lang="EN-US" style="font-size: 14.0pt">CS</span><span style="font-size: 14.0pt">,</span><span lang="EN-US" style="font-size: 14.0pt">DS</span><span style="font-size: 14.0pt">,</span><span lang="EN-US" style="font-size: 14.0pt">SS</span><span style="font-size: 14.0pt"> 
&#1080; </span><span lang="EN-US" style="font-size: 14.0pt">ES</span><span style="font-size: 14.0pt">.
</span></p>
<p class="MsoNormal" style="text-indent: 35.4pt">
<span style="font-size: 14.0pt">&#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">CS</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082;&#1086;&#1076;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; 
&#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1076; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1069;&#1090;&#1086; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100;<span style="color: lime"> </span>&#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;. 
&#1050;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1074; </span><span lang="EN-US" style="font-size: 14.0pt">CS</span><span style="font-size: 14.0pt"> 
&#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1080;&#1076;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">jxx</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">call</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">int</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">ret</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">iret</span><span style="font-size: 14.0pt">. 
&#1060;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1087;&#1072;&#1088;&#1072; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; </span><span lang="EN-US" style="font-size: 14.0pt">CS </span>
<span style="font-size: 14.0pt">&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">IP</span><span style="font-size: 14.0pt"> 
&#1080; &#1101;&#1090;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; </span><span lang="EN-US" style="font-size: 14.0pt">CS</span><span style="font-size: 14.0pt">:</span><span lang="EN-US" style="font-size: 14.0pt">IP</span><span style="font-size: 14.0pt">. 
&#1040;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; 
&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&#1093;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">DS</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; 
&#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; 
&#1079;&#1072;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1093; </span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">,</span><span lang="EN-US" style="font-size: 14.0pt">SI
</span><span style="font-size: 14.0pt">&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">ES</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;, 
&#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; 
&#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, </span><span lang="EN-US" style="font-size: 14.0pt">DS</span><span style="font-size: 14.0pt"> 
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;-&#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;, &#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">ES</span><span style="font-size: 14.0pt"> 
– &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;-&#1087;&#1088;&#1080;&#1077;&#1084;&#1085;&#1080;&#1082;&#1072;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">SS</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089;&#1090;&#1077;&#1082;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; 
&#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1077;&#1082; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1089;&#1090;&#1077;&#1082;&#1072; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1093; </span><span lang="EN-US" style="font-size: 14.0pt">SP </span>
<span style="font-size: 14.0pt">&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">BP</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b><i>&#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; 
&#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1086;&#1074; &#1080;&#1083;&#1080; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074;.</i></b> &#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">FLAGS</span><span style="font-size: 14.0pt"> 
&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074; &#1089;&#1077;&#1073;&#1103; &#1073;&#1080;&#1090;&#1099;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1077;&#1076;&#1080;&#1085;&#1080;&#1095;&#1085;&#1086;&#1077; &#1080;&#1083;&#1080; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1077; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;&#1093;. &#1069;&#1090;&#1080; &#1073;&#1080;&#1090;&#1099; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1073;&#1091;&#1082;&#1074;&#1072;&#1084;&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">C</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">P</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">A</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">Z</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">S</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">T</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">I</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">D</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">O</span><span style="font-size: 14.0pt">, 
&#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1084;&#1091; &#1073;&#1080;&#1090;&#1091; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1073;&#1091;&#1082;&#1074;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">C</span><span style="font-size: 14.0pt">. 
&#1044;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074; &#1101;&#1090;&#1086;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; </span>
<span lang="EN-US" style="font-size: 14.0pt">pushf </span>
<span style="font-size: 14.0pt">&nbsp;&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">popf</span><span style="font-size: 14.0pt">. 
&#1053;&#1080;&#1078;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1084; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079; &#1073;&#1080;&#1090;&#1086;&#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1086;&#1074;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;</span></p>
<table class="MsoNormalTable" border="1" cellspacing="0" cellpadding="0" style="border-collapse: collapse; border: medium none; margin-left: 5.4pt">
	<tr style="page-break-inside: avoid">
		<td width="37" valign="top" style="width: 27.9pt; border: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">15</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">14</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">13</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">12</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">11</span></td>
		<td width="37" valign="top" style="width: 27.95pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">10</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">9</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">8</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">7</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">6</span></td>
		<td width="37" valign="top" style="width: 27.95pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">5</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">4</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">3</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">2</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">1</span></td>
		<td width="37" valign="top" style="width: 27.95pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: 1.0pt solid windowtext; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">0</span></td>
	</tr>
	<tr style="page-break-inside: avoid">
		<td width="37" valign="top" style="width: 27.9pt; border-left: 1.0pt solid windowtext; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">X</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">X</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">X</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">X</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">OF</span></td>
		<td width="37" valign="top" style="width: 27.95pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">DF</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">IF</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">TF</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">SF</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">ZF</span></td>
		<td width="37" valign="top" style="width: 27.95pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">X</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">AF</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">X</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">PF</span></td>
		<td width="37" valign="top" style="width: 27.9pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">X</span></td>
		<td width="37" valign="top" style="width: 27.95pt; border-left: medium none; border-right: 1.0pt solid windowtext; border-top: medium none; border-bottom: 1.0pt solid windowtext; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a0"><span lang="EN-US">CF</span></td>
	</tr>
</table>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">CF</span><span style="font-size: 14.0pt"> 
– &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072;. </span><span lang="EN-US" style="font-size: 14.0pt">CF</span><span style="font-size: 14.0pt"> 
&#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; 1 &#1087;&#1088;&#1080; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; &#1080;&#1083;&#1080; &#1079;&#1072;&#1077;&#1084;&#1072; &#1080;&#1079; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1075;&#1086; &#1073;&#1080;&#1090;&#1072; 
&#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077;<span style="color: lime"> </span>&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 
&#1074;&#1099;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1073;&#1080;&#1090;&#1072; &#1087;&#1088;&#1080; &#1089;&#1076;&#1074;&#1080;&#1075;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1085;&#1086;&#1083;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;
</span><span lang="EN-US" style="font-size: 14.0pt">clc</span><span style="font-size: 14.0pt"> 
&#1080; &#1074; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; </span><span lang="EN-US" style="font-size: 14.0pt">stc</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">PF</span><span style="font-size: 14.0pt"> 
– &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1095;&#1077;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; 1, &#1077;&#1089;&#1083;&#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080;&#1084;&#1077;&#1077;&#1090; 
&#1095;&#1077;&#1090;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">AF</span><span style="font-size: 14.0pt">– 
&#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; 
&#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1086;&#1081; &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1082;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;-&#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077;. &#1069;&#1090;&#1086;&#1090; &#1073;&#1080;&#1090; 
&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1080;&#1079; &#1084;&#1083;&#1072;&#1076;&#1096;&#1077;&#1081; &#1090;&#1077;&#1090;&#1088;&#1072;&#1076;&#1099; &#1074; &#1089;&#1090;&#1072;&#1088;&#1096;&#1091;&#1102; &#1087;&#1088;&#1080; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1083;&#1080;&#1073;&#1086; &#1079;&#1072;&#1077;&#1084; &#1087;&#1088;&#1080; 
&#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1085;&#1080;&#1080;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">ZF</span><span style="font-size: 14.0pt"> 
– &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1085;&#1091;&#1083;&#1103;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; 1 &#1087;&#1088;&#1080; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1084; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">SF</span><span style="font-size: 14.0pt"> 
– &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1079;&#1085;&#1072;&#1082;&#1072;. </span><span lang="EN-US" style="font-size: 14.0pt">ZF</span><span style="font-size: 14.0pt">=1, 
&#1077;&#1089;&#1083;&#1080; &#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1081; &#1073;&#1080;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1088;&#1072;&#1074;&#1077;&#1085; 1. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100; &#1086;&#1085; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1075;&#1086; &#1073;&#1080;&#1090;&#1072; 
&#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1079;&#1085;&#1072;&#1082; &#1095;&#1080;&#1089;&#1083;&#1072; 
(&#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1076;&#1083;&#1103; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; &#1080; &#1085;&#1086;&#1083;&#1100; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093;).</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">TF</span><span style="font-size: 14.0pt"> 
– &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1090;&#1088;&#1072;&#1089;&#1089;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;. &#1069;&#1090;&#1086;&#1090; &#1073;&#1080;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1084;. &#1045;&#1089;&#1083;&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">T</span><span style="font-size: 14.0pt">=1, 
&#1090;&#1086; &#1087;&#1086; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1102; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090; &#1052;&#1055;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1073;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">T</span><span style="font-size: 14.0pt"> 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1080; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;, &#1080;&#1085;&#1076;&#1080;&#1094;&#1080;&#1088;&#1091;&#1102;&#1097;&#1077;&#1081; 
&#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1052;&#1055;).</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">IF</span><span style="font-size: 14.0pt"> 
– &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;. &#1055;&#1088;&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">I</span><span style="font-size: 14.0pt">=1 
&#1052;&#1055; &#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1091;&#1077;&#1090; &#1085;&#1072; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086; &#1074;&#1093;&#1086;&#1076;&#1091; </span>
<span lang="EN-US" style="font-size: 14.0pt">INTR</span><span style="font-size: 14.0pt">. 
&#1055;&#1088;&#1080; </span><span lang="EN-US" style="font-size: 14.0pt">I</span><span style="font-size: 14.0pt">=0 
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086; &#1074;&#1093;&#1086;&#1076;&#1091; </span><span lang="EN-US" style="font-size: 14.0pt">INTR</span><span style="font-size: 14.0pt"> 
&#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080;&#1083;&#1080; &#1084;&#1072;&#1089;&#1082;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">I</span><span style="font-size: 14.0pt"> 
&#1085;&#1077; &#1074;&#1083;&#1080;&#1103;&#1077;&#1090; &#1085;&#1072; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1103;&#1090;&#1080;&#1077; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1085;&#1077;&#1084;&#1072;&#1089;&#1082;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1093; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; (&#1074;&#1093;&#1086;&#1076; </span>
<span lang="EN-US" style="font-size: 14.0pt">NMI </span>
<span style="font-size: 14.0pt">&#1052;&#1055;) &#1080; &#1085;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1093; 
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; &#1087;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; </span><span lang="EN-US" style="font-size: 14.0pt">int</span><span style="font-size: 14.0pt">.<span style="color: lime">
</span>&#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1085;&#1086;&#1083;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; </span>
<span lang="EN-US" style="font-size: 14.0pt">cli</span><span style="font-size: 14.0pt"> 
&#1080; &#1074; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; </span><span lang="EN-US" style="font-size: 14.0pt">sti</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">DF</span><span style="font-size: 14.0pt"> 
– &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1044;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; 
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; (&#1073;&#1072;&#1081;&#1090;&#1086;&#1074;, &#1089;&#1083;&#1086;&#1074; &#1080; &#1090;.&#1076;.) &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1073;&#1083;&#1086;&#1082;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;
</span><span lang="EN-US" style="font-size: 14.0pt">SI </span>
<span style="font-size: 14.0pt">&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt">. 
&#1055;&#1086;&#1089;&#1083;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1085;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1052;&#1055; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; 
&#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;. &#1045;&#1089;&#1083;&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">D</span><span style="font-size: 14.0pt">=0, 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1077; &#1089; &#1073;&#1083;&#1086;&#1082;&#1072;&#1084;&#1080;, &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1076;&#1083;&#1103; 
&#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;. &#1045;&#1089;&#1083;&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">D</span><span style="font-size: 14.0pt">=1, 
&#1090;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1102;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1101;&#1090;&#1080;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; 
&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1085;&#1086;&#1083;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; </span><span lang="EN-US" style="font-size: 14.0pt">
cld</span><span style="font-size: 14.0pt"> &#1080; &#1074; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; </span>
<span lang="EN-US" style="font-size: 14.0pt">std</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1080;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">OF</span><span style="font-size: 14.0pt"> 
– &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080; 
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;&#1080;, &#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; 
&#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1087;&#1086;&#1090;&#1077;&#1088;&#1102; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1075;&#1086; &#1073;&#1080;&#1090;&#1072; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">X</span><span style="font-size: 14.0pt"> 
– &#1079;&#1072;&#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1073;&#1080;&#1090;&#1099;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1047;&#1072;&#1084;&#1077;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1092;&#1083;&#1072;&#1075;&#1080; 
&#1084;&#1083;&#1072;&#1076;&#1096;&#1077;&#1075;&#1086; &#1073;&#1072;&#1081;&#1090;&#1072; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1086;&#1074; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1080;&#1083;&#1080; 
&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;. &#1060;&#1083;&#1072;&#1075;&#1080; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;&#1075;&#1086; &#1073;&#1072;&#1081;&#1090;&#1072;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1092;&#1083;&#1072;&#1075;&#1072; 
&#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1090;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1080; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; &#1085;&#1072; 
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1054;&#1085;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1084;&#1080;. 
&#1060;&#1083;&#1072;&#1075;&#1080; &#1084;&#1083;&#1072;&#1076;&#1096;&#1077;&#1075;&#1086; &#1073;&#1072;&#1081;&#1090;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1084;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074; &#1076;&#1083;&#1103; 
&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.</span></p>
<p class="MsoNormal"><b><span style="font-size: 14.0pt">&nbsp;</span></b></p>
<p class="MsoNormal" align="center" style="text-align: center"><b>
<span style="font-size: 14.0pt">1.2. &#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1072;&#1103; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;.</span></b></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1055;&#1091;&#1089;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; 
&#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; 
&#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; 
&#1086;&#1085;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1102;&#1090; &#1080;&#1079; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;. 
&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1076;&#1083;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1052;&#1055; 8086&nbsp; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; 16-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1099;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;, &#1101;&#1090;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1077;&#1084;&#1091; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; 65536 (</span><span lang="EN-US" style="font-size: 14.0pt">FFFFh</span><span style="font-size: 14.0pt">) 
&#1073;&#1072;&#1081;&#1090; &#1080;&#1083;&#1080; 64&#1050; (1&#1050; = 1024 &#1073;&#1072;&#1081;&#1090; = 2<sup>10</sup> &#1073;&#1072;&#1081;&#1090;) &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; 
&#1082;&#1072;&#1082; &#1074;&#1089;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1077;&#1075;&#1086; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; 1 &#1052;&#1073;&#1072;&#1081;&#1090;. </span></p>
<p class="MsoNormal" style="text-indent: 35.4pt">
<span style="font-size: 14.0pt">&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084;, &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1084;&#1086;&#1084; 
1 &#1052;&#1073;&#1072;&#1081;&#1090; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; 16-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1052;&#1055;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074;&#1089;&#1102; 
&#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1084;&#1091;&#1102; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1085;&#1072; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099; &#1086;&#1073;&#1098;&#1077;&#1084;&#1086;&#1084; 64 &#1050;&#1073;&#1072;&#1081;&#1090;, &#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086;,<span style="color: lime">
</span>&#1095;&#1090;&#1086; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1087;&#1072;&#1088;&#1072;&#1075;&#1088;&#1072;&#1092;&#1072; (16 &#1073;&#1072;&#1081;&#1090;) 
&#1086;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084; 0, 16, 32, &#1080; &#1090;.&#1076;., &#1080;&#1083;&#1080; &#1074; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1086;&#1081; 
&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1089;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; 0, 10, 20, &#1080; &#1090;.&#1076;. &#1056;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1083;&#1080; 
&#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;. &#1053;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; 
&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1079; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; </span>
<span lang="EN-US" style="font-size: 14.0pt">CS</span><span style="font-size: 14.0pt">,</span><span lang="EN-US" style="font-size: 14.0pt">DS</span><span style="font-size: 14.0pt">,</span><span lang="EN-US" style="font-size: 14.0pt">SS</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">ES</span><span style="font-size: 14.0pt">. 
(&#1042;&#1089;&#1077; &#1101;&#1090;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;&nbsp; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1080;&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1099;&#1077;.)&nbsp; &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1089;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; 
&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; 00000<sub>16</sub>, 00010<sub>16</sub>, 00020<sub>16</sub>, 
…, </span><span lang="EN-US" style="font-size: 14.0pt">FFFE</span><span style="font-size: 14.0pt">0<sub>16</sub>,
</span><span lang="EN-US" style="font-size: 14.0pt">FFFF</span><span style="font-size: 14.0pt">0<sub>16</sub>. 
&#1042; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1080;&#1093; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074; &#1073;&#1077;&#1079; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1085;&#1091;&#1083;&#1103;, 
&#1090;.&#1077;. 0000<sub>16</sub>, 0001<sub>16</sub>, 0002<sub>16</sub>, …, </span>
<span lang="EN-US" style="font-size: 14.0pt">FFFE</span><sub><span style="font-size: 14.0pt">16</span></sub><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">FFFF</span><sub><span style="font-size: 14.0pt">16</span></sub><span style="font-size: 14.0pt">. 
&#1069;&#1090;&#1080; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1084;&#1080; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1084;&#1080; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1100;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; 
&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1084;&#1091;<span style="color: lime">
</span>&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1076;&#1086;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1099;&#1081; &#1085;&#1086;&#1083;&#1100;. 
&#1060;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; (&#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1074;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1073;&#1072;&#1081;&#1090;&#1072; 
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1086;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;) &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1091;&#1084;&#1084;&#1086;&#1081; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1086;&#1084; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077;, &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1057;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1074;&#1099;&#1081; 
&#1085;&#1086;&#1084;&#1077;&#1088; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1073;&#1072;&#1081;&#1090;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1086;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1079; 
&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1052;&#1055;: </span><span lang="EN-US" style="font-size: 14.0pt">IP</span><span style="font-size: 14.0pt"> 
(&#1076;&#1083;&#1103; &#1082;&#1086;&#1076;&#1072;),&nbsp; </span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">SI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt"> 
(&#1076;&#1083;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;),&nbsp; </span><span lang="EN-US" style="font-size: 14.0pt">BP</span><span style="font-size: 14.0pt">,</span><span lang="EN-US" style="font-size: 14.0pt">SP</span><span style="font-size: 14.0pt"> 
(&#1076;&#1083;&#1103; &#1089;&#1090;&#1077;&#1082;&#1072;). &#1057;&#1091;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;: &#1052;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1077;&#1090; 
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; (&#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089;), &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1103; &#1082; &#1085;&#1077;&#1084;&#1091; 4 &#1084;&#1083;&#1072;&#1076;&#1096;&#1080;&#1093; 
&#1085;&#1091;&#1083;&#1077;&#1074;&#1099;&#1093; &#1073;&#1080;&#1090;&#1072;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; 20-&#1073;&#1080;&#1090;&#1085;&#1099;&#1084; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;) &#1080; 
&#1087;&#1088;&#1080;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082; &#1084;&#1083;&#1072;&#1076;&#1096;&#1080;&#1084; 16 &#1073;&#1080;&#1090;&#1072;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103;.<span style="color: lime">
</span>&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; 20-&#1073;&#1080;&#1090;&#1086;&#1074;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1089;&#1086;&#1073;&#1086;&#1081; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1080;&#1083;&#1080; 
&#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1103;&#1095;&#1077;&#1081;&#1082;&#1080; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;.</span></p>
<p class="MsoNormal" style="text-indent: 35.4pt">
<span style="font-size: 14.0pt">&nbsp;</span></p>
<p class="Normal" style="text-indent: 35.45pt">
<span style="font-size: 14.0pt; color: lime">&nbsp;</span></p>
<p class="Normal" style="text-indent: 35.45pt">
<span style="font-size: 14.0pt; color: lime"><!--[if gte vml 1]><v:shape
 id="_x0000_s1045" type="#_x0000_t75" style='width:396pt;height:154.5pt'
 fillcolor="window">
 <v:imagedata src="1.files/image003.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=528 height=206
src="1.files/image004.gif" v:shapes="_x0000_s1045"><![endif]><!--[if gte mso 9]><![endif]--></span></p>
<p class="MsoNormal" style="text-indent: 35.4pt">
<span lang="EN-US" style="font-size: 14.0pt">&nbsp;</span></p>
<p class="MsoNormal" style="text-indent: 35.4pt">
<span style="font-size: 14.0pt">&#1042; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082; 
&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1087;&#1088;&#1077;&#1092;&#1080;&#1082;&#1089; &#1079;&#1072;&#1084;&#1077;&#1085;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086; 
&#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1093; </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">SI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">BP</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">SP</span><span style="font-size: 14.0pt"> 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1090;&#1100;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1074; &#1055;&#1069;&#1042;&#1052; &#1080;&#1084;&#1077;&#1077;&#1090; 
&#1082;&#1086;&#1083;&#1100;&#1094;&#1077;&#1074;&#1091;&#1102; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102;. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; </span>
<span lang="EN-US" style="font-size: 14.0pt">FFFF</span><sub><span style="font-size: 14.0pt">16</span></sub><span style="font-size: 14.0pt"> 
&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; 0000<sub>16 </sub>&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084; 0000<sub>16
</sub>&nbsp;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; </span><span lang="EN-US" style="font-size: 14.0pt">FFFF</span><sub><span style="font-size: 14.0pt">16</span></sub><span style="font-size: 14.0pt">.
</span></p>
<p class="MsoNormal" style="text-indent: 35.4pt">
<span style="font-size: 14.0pt">&#1050;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; 
&#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1093; &#1089;&#1074;&#1086;&#1077; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1090;&#1088;&#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; 
&#1090;&#1080;&#1087;&#1072; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;:</span></p>
<p class="MsoNormal" style="text-indent: -18.0pt; margin-left: 53.4pt">
<span style="font-size: 14.0pt">1.<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;
</span>&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086;&#1076;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1084;
</span><span lang="EN-US" style="font-size: 14.0pt">CS</span><span style="font-size: 14.0pt">;</span></p>
<p class="MsoNormal" style="text-indent: -18.0pt; margin-left: 53.4pt">
<span style="font-size: 14.0pt">2.<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;
</span>&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;, &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1090;&#1089;&#1103; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1084; </span><span lang="EN-US" style="font-size: 14.0pt">DS</span><span style="font-size: 14.0pt">;</span></p>
<p class="MsoNormal" style="text-indent: -18.0pt; margin-left: 53.4pt">
<span style="font-size: 14.0pt">3.<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;
</span>&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1089;&#1090;&#1077;&#1082;&#1072;, &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1084; </span>
<span lang="EN-US" style="font-size: 14.0pt">SS</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoPlainText">&#1055;&#1088;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; &#1040;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; 
&#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;:</p>
<p class="a0">&lt;&#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&gt;:&lt;&#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;&gt;</p>
<p class="MsoPlainText" style="text-indent: 0cm">&#1080;&#1083;&#1080;</p>
<p class="a0">&lt;&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&gt;:&lt;&#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt;</p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;</span></p>
<p class="MsoNormal" align="center" style="text-align: center"><b>
<span style="font-size: 14.0pt">1.3. &#1057;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080;.</span></b></p>
<p class="MsoNormal"><span style="font-size: 14.0pt; color: lime">&nbsp;</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; 
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072;&#1084;&#1080;. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; 
&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080;. &#1042;&#1089;&#1077; 
&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1085;&#1077;&#1089;&#1090;&#1080; &#1082; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1075;&#1088;&#1091;&#1087;&#1087;:</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1053;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;, 
&#1087;&#1088;&#1103;&#1084;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;, &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;, 
&#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1082;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;, &#1073;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;, 
&#1085;&#1077;&#1103;&#1074;&#1085;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b>
&#1053;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;.</b> &#1047;&#1076;&#1077;&#1089;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1054;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076; 
&#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1073;&#1072;&#1081;&#1090;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1084;&#1083;&#1072;&#1076;&#1096;&#1080;&#1081; &#1073;&#1072;&#1081;&#1090; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; 
&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1084;&#1091; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">mov</span><span style="font-size: 14.0pt">&nbsp;
</span><span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">, 
1234</span><span lang="EN-US" style="font-size: 14.0pt">h</span><span style="font-size: 14.0pt">&nbsp;
</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1047;&#1076;&#1077;&#1089;&#1100; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1086;&#1077; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; (&#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1091;&#1082;&#1074;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">h</span><span style="font-size: 14.0pt">) 
1234 &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span><span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt"> 
&#1052;&#1055;. &#1052;&#1083;&#1072;&#1076;&#1096;&#1080;&#1081; &#1073;&#1072;&#1081;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 34, &#1072; &#1089;&#1090;&#1072;&#1088;&#1096;&#1080;&#1081; – 12.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b>&#1055;&#1088;&#1103;&#1084;&#1072;&#1103; 
&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;.</b> &#1047;&#1076;&#1077;&#1089;&#1100; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">mov</span><span style="font-size: 14.0pt">&nbsp;
</span><span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">my</span><span style="font-size: 14.0pt">_</span><span lang="EN-US" style="font-size: 14.0pt">label</span><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1042; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt"> 
&#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1084;&#1077;&#1090;&#1082;&#1080; </span><span lang="EN-US" style="font-size: 14.0pt">my</span><span style="font-size: 14.0pt">_</span><span lang="EN-US" style="font-size: 14.0pt">label</span><span style="font-size: 14.0pt">, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1072;&#1084;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b>&#1056;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;&#1072;&#1103; 
&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;.</b> &#1054;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&nbsp; &#1080;&#1083;&#1080; &#1074; 
&#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1079; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;. &#1048;&#1084;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1072;&#1084;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">mov</span><span style="font-size: 14.0pt">&nbsp;
</span><span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">BX</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1047;&#1076;&#1077;&#1089;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;
</span><span lang="EN-US" style="font-size: 14.0pt">BX </span>
<span style="font-size: 14.0pt">&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b>&#1050;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;.</b> &#1057;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;
</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">SI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">BP</span><span style="font-size: 14.0pt">. 
&#1053;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;, 
&#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">mov</span><span style="font-size: 14.0pt">&nbsp;
</span><span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">, 
[</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">]</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; 
&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;: &#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1087;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; 
&#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1102; &#1080;&#1079; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1074;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">. 
&#1045;&#1089;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085; &#1087;&#1088;&#1077;&#1092;&#1080;&#1082;&#1089; &#1079;&#1072;&#1084;&#1077;&#1085;&#1099; </span><span lang="EN-US" style="font-size: 14.0pt">CS</span><span style="font-size: 14.0pt">, 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1096;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077;:</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">mov</span><span style="font-size: 14.0pt">&nbsp;
</span><span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">CS</span><span style="font-size: 14.0pt">:[</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">]</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1047;&#1076;&#1077;&#1089;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1090;&#1077; &#1078;&#1077; 
&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1085;&#1086; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072; &#1073;&#1077;&#1088;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1082;&#1086;&#1076;&#1072;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b>&#1054;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; 
&#1082;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;.</b> &#1057;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1089;&#1091;&#1084;&#1084;&#1072; 
&#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; &#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">SI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">BP</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">mov</span><span style="font-size: 14.0pt">&nbsp;
</span><span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">, 
[</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">+10]</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1047;&#1076;&#1077;&#1089;&#1100; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; 
&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; </span><span lang="EN-US" style="font-size: 14.0pt">DS</span><span style="font-size: 14.0pt"> 
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1091;&#1084;&#1084;&#1086;&#1081; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1080;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt"> 
&#1089; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084; 10. &#1052;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1097;&#1077; &#1076;&#1074;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1101;&#1090;&#1086;&#1081; &#1078;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;:</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">mov</span><span style="font-size: 14.0pt">&nbsp;
</span><span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">, 
[</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">]+10</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">mov</span><span style="font-size: 14.0pt">&nbsp;
</span><span lang="EN-US" style="font-size: 14.0pt">AX</span><span style="font-size: 14.0pt">, 
10[</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">]</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1069;&#1090;&#1086;&#1090; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080; 
&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">,</span><span lang="EN-US" style="font-size: 14.0pt">BP
</span><span style="font-size: 14.0pt">&#1080; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1099;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1099;&#1077; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; </span><span lang="EN-US" style="font-size: 14.0pt">SI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b>&#1041;&#1072;&#1079;&#1086;&#1074;&#1072;&#1103; 
&#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;.</b> &#1057;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1089;&#1091;&#1084;&#1084;&#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1074; 
&#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; </span><span lang="EN-US" style="font-size: 14.0pt">BX </span>
<span style="font-size: 14.0pt">&#1080;&#1083;&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">BP</span><span style="font-size: 14.0pt">, 
&#1074; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1086;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; </span><span lang="EN-US" style="font-size: 14.0pt">SI</span><span style="font-size: 14.0pt"> 
&#1080;&#1083;&#1080; </span><span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt"> 
&#1080;&#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077;. &#1042; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1069;&#1090;&#1086;&#1090; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; 
&#1091;&#1076;&#1086;&#1073;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1099;&#1093; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1086;&#1074;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>
<span lang="EN-US" style="font-size: 14.0pt">mov&nbsp; AX, my_array[BX][SI]</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1047;&#1076;&#1077;&#1089;&#1100; </span>
<span lang="EN-US" style="font-size: 14.0pt">my</span><span style="font-size: 14.0pt">_</span><span lang="EN-US" style="font-size: 14.0pt">array</span><span style="font-size: 14.0pt"> 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072;.</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <b>&#1053;&#1077;&#1103;&#1074;&#1085;&#1072;&#1103; 
&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103;.</b> &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1077;&#1103;&#1074;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1076;&#1086;&#1084; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;. 
&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093; &#1085;&#1077;&#1103;&#1074;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;<span style="color: lime">
</span>&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; </span><span lang="EN-US" style="font-size: 14.0pt">SI</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoNormal" style="text-align: justify; text-indent: 35.45pt">
<span style="font-size: 14.0pt">&#1045;&#1089;&#1083;&#1080; &#1074; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103;&#1093; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1074; &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1089;&#1082;&#1086;&#1073;&#1082;&#1072;&#1093;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; </span>
<span lang="EN-US" style="font-size: 14.0pt">MOV AX</span><span style="font-size: 14.0pt">,</span><span lang="EN-US" style="font-size: 14.0pt">A</span><span style="font-size: 14.0pt">[</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">], 
&#1090;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089; &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1084; 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1077; </span>
<span lang="EN-US" style="font-size: 14.0pt">A</span><sub><span style="font-size: 14.0pt">&#1048;&#1057;&#1055;</span></sub><span style="font-size: 14.0pt">=(</span><span lang="EN-US" style="font-size: 14.0pt">A</span><span style="font-size: 14.0pt">+[</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">])
</span><span lang="EN-US" style="font-size: 14.0pt">mod</span><span style="font-size: 14.0pt"> 
2<sup>16</sup>, &#1075;&#1076;&#1077; [</span><span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">] 
&#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">. 
&#1058;&#1086; &#1077;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;, &#1087;&#1088;&#1080;&#1073;&#1072;&#1074;&#1080;&#1090; &#1082; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; &#1040;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; 
&#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; (&#1089;&#1084;. &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;), &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">, 
&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1086;&#1074;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1080; &#1080;&#1079; &#1103;&#1095;&#1077;&#1081;&#1082;&#1080; &#1089; &#1101;&#1090;&#1080;&#1084; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1084; &#1074;&#1086;&#1079;&#1100;&#1084;&#1077;&#1090; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;. 
&#1045;&#1089;&#1083;&#1080; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1089;&#1091;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1072;&#1089;&#1100; &#1089;&#1091;&#1084;&#1084;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; 65535, &#1090;&#1086; &#1086;&#1090; &#1085;&#1077;&#1077; &#1073;&#1077;&#1088;&#1091;&#1090;&#1089;&#1103; 
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; 16 &#1073;&#1080;&#1090; (&#1085;&#1072; &#1101;&#1090;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; </span>
<span lang="EN-US" style="font-size: 14.0pt">mod </span>
<span style="font-size: 14.0pt">&nbsp;&#1074; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1077;).</span></p>
<p class="MsoNormal" style="text-align: justify; text-indent: 35.45pt">
<span style="font-size: 14.0pt">&#1055;&#1086;&#1076;&#1086;&#1073;&#1085;&#1072;&#1103; &#1079;&#1072;&#1084;&#1077;&#1085;&#1072; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1080;&#1079; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1085;&#1072;&nbsp; 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1077;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;, &#1072; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;, &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074; 
&#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; – &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1084;-&#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;-&#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077; &#1083;&#1102;&#1073;&#1086;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;, &#1072; &#1083;&#1080;&#1096;&#1100; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093;: </span>
<span lang="EN-US" style="font-size: 14.0pt">BX</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">BP</span><span style="font-size: 14.0pt">,
</span><span lang="EN-US" style="font-size: 14.0pt">SI </span>
<span style="font-size: 14.0pt">&#1080; </span>
<span lang="EN-US" style="font-size: 14.0pt">DI</span><span style="font-size: 14.0pt">.</span></p>
<p class="MsoPlainText">&#1040;&#1085;&#1072;&#1083;&#1080;&#1079; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; &#1040;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; 
&#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1099;&#1074;&#1086;&#1076;, &#1095;&#1090;&#1086; &#1074; &#1085;&#1080;&#1093;, &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1083;&#1080;&#1096;&#1100; &#1080;&#1079; &#1090;&#1088;&#1077;&#1093; 
&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1077;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; – &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082;&#1086;&#1076;&#1072;, &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089;&#1090;&#1077;&#1082;&#1072;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, &#1090;.&#1077;. &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; 
&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086;&#1076;&#1072;. &#1042; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1093; &#1089;&#1086; &#1089;&#1090;&#1077;&#1082;&#1086;&#1084; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1080;&#1079; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; 
&#1089;&#1090;&#1077;&#1082;&#1072;. &#1042; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1078;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093;&nbsp; (&#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1082;&#1072;&#1093;, &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080; &#1090;.&#1076;.) &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;, 
&#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1080;&#1079; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1057; &#1091;&#1095;&#1077;&#1090;&#1086;&#1084; &#1101;&#1090;&#1086;&#1081; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090; &#1088;&#1103;&#1076; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1074;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093; &#1085;&#1077; 
&#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1103;&#1074;&#1085;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;, &#1072; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; 
&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1083;&#1080;&#1089;&#1100; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1093;, &#1072; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086;: &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">CS </span>&#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; 
&#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082;&#1086;&#1076;&#1072;, &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">DS</span> – &#1085;&#1072; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; 
&#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1072; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">SS</span> – &#1085;&#1072; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089;&#1090;&#1077;&#1082;&#1072;. &#1058;&#1072;&#1082;&#1080;&#1084; 
&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1091; <span lang="EN-US">
CS</span>; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103;&#1093;, &#1077;&#1089;&#1083;&#1080; &#1072;&#1076;&#1088;&#1077;&#1089; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; &#1085;&#1077; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; 
&#1080;&#1083;&#1080; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1085;&#1086; &#1089;&#1088;&#1077;&#1076;&#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1085;&#1077;&#1090; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;
<span lang="EN-US">BP</span>, &#1090;&#1086; &#1101;&#1090;&#1086;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; &#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; 
&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1091; <span lang="EN-US">DS</span>; &#1077;&#1089;&#1083;&#1080; &#1078;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089; 
&#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1091; <span lang="EN-US">BP</span>, &#1090;&#1086; &#1086;&#1085; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; 
&#1074; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1089;&#1090;&#1077;&#1082;&#1072; &#1080; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1091;
<span lang="EN-US">SS</span>.</p>
<p class="MsoPlainText">&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, 
&#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1086;&#1090; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1082;&#1086;&#1076;&#1072;, &#1089;&#1090;&#1077;&#1082;&#1072;&nbsp; &#1080;&#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1093; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; 
&#1101;&#1090;&#1080; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1103;&#1074;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:</p>
<p class="MsoPlainText"><span lang="EN-US">MOV AX</span>, <span lang="EN-US">ES</span>:[<span lang="EN-US">BX</span>].</p>
<p class="MsoPlainText"><b>&nbsp;</b></p>
<p class="MsoNormal" align="center" style="text-align: center"><b>
<span style="font-size: 14.0pt">1.4. &#1054;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1089;&#1090;&#1077;&#1082;&#1072;.</span></b></p>
<p class="MsoNormal" align="center" style="text-align: center"><b>
<span style="font-size: 14.0pt">&nbsp;</span></b></p>
<p class="MsoNormal"><b><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span></b>
<span style="font-size: 14.0pt">&#1057;&#1090;&#1077;&#1082; – &#1101;&#1090;&#1086; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1072;&#1103; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1072;&#1103; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084; &#1073;&#1077;&#1079;&#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; 
&#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. </span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&#1069;&#1090;&#1086;&#1090; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;, 
&#1095;&#1090;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1085; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084;. &#1040;&#1076;&#1088;&#1077;&#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; 
&#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1077;&#1082;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1084; </span>
<span lang="EN-US" style="font-size: 14.0pt">SS</span><span style="font-size: 14.0pt">. 
&#1044;&#1083;&#1103; &#1052;&#1055; 8086 &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1089;&#1090;&#1077;&#1082; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1083;&#1086;&#1074; (&#1087;&#1086; 2 &#1073;&#1072;&#1081;&#1090;&#1072;). &#1055;&#1072;&#1088;&#1072; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; </span><span lang="EN-US" style="font-size: 14.0pt">SS</span><span style="font-size: 14.0pt">:</span><span lang="EN-US" style="font-size: 14.0pt">SP</span><span style="font-size: 14.0pt"> 
&#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1091; &#1089;&#1090;&#1077;&#1082;&#1072;. &#1044;&#1083;&#1103; &#1079;&#1072;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072; &#1074; &#1089;&#1090;&#1077;&#1082; 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; </span><span lang="EN-US" style="font-size: 14.0pt">push</span><span style="font-size: 14.0pt">, 
&#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; </span><span lang="EN-US" style="font-size: 14.0pt">
SP </span><span style="font-size: 14.0pt">&nbsp;&#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1076;&#1074;&#1072;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084;<span style="color: lime">
</span>&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1089;&#1083;&#1086;&#1074;&#1072; &#1074; &#1089;&#1090;&#1077;&#1082;. &#1044;&#1083;&#1103; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; </span><span lang="EN-US" style="font-size: 14.0pt">pop</span><span style="font-size: 14.0pt">, 
&#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1077;&#1082;&#1072;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; </span>
<span lang="EN-US" style="font-size: 14.0pt">SP</span><span style="font-size: 14.0pt"> 
&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1076;&#1074;&#1072;. &#1042;&#1072;&#1078;&#1085;&#1086; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1089;&#1090;&#1077;&#1082; &#1088;&#1072;&#1089;&#1090;&#1077;&#1090; &#1074; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1082; &#1085;&#1072;&#1095;&#1072;&#1083;&#1091; 
&#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1080; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1082; &#1077;&#1077; &#1082;&#1086;&#1085;&#1094;&#1091;. &#1057;&#1090;&#1077;&#1082; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; 
&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084; &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; 
&#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088; &#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;.</span></p>
<p class="MsoNormal" align="center" style="text-align: center"><b>
<span style="font-size: 14.0pt">1.5. &#1054;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;.</span></b></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;</span></p>
<p class="MsoNormal"><span style="font-size: 14.0pt">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; 
&#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; – &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;-&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;, &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; 
&#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1081;&nbsp; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;. &#1058;&#1072;&#1082;&#1080;&#1077; &#1086;&#1089;&#1086;&#1073;&#1099;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; 
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080; &#1080; &#1076;&#1077;&#1083;&#1103;&#1090;&#1089;&#1103; &#1085;&#1072; &#1076;&#1074;&#1072; &#1074;&#1080;&#1076;&#1072;: &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; 
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1103;&#1090;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;, &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1082; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1091;, &#1089;&#1072;&#1084;&#1086; 
&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1089;&#1093;&#1086;&#1076;&#1103;&#1090; &#1086;&#1090; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1074; &#1076;&#1074;&#1091;&#1093; 
&#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;: &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; </span>
<span lang="EN-US" style="font-size: 14.0pt">int </span>
<span style="font-size: 14.0pt">&#1080;&#1083;&#1080; &#1087;&#1088;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;&#1093;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; &#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; 
&#1085;&#1072; &#1085;&#1086;&#1083;&#1100; &#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; </span>
<span lang="EN-US" style="font-size: 14.0pt">div</span><span style="font-size: 14.0pt">, 
&#1082;&#1086;&#1075;&#1076;&#1072; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;. </span>
</p>
<p class="MsoBodyText2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1055;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1077; &#1082; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1077; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; 
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1082; &#1087;&#1088;&#1077;&#1088;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;. 
&#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084;&nbsp; &#1082; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1077; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1086; 
&#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1080; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1093; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1086;&#1081; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1089;&#1083;&#1077; 
&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099;.</p>
<p class="MsoPlainText">&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1074;&#1080;&#1076;&#1072;&#1084;&#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1092;&#1083;&#1072;&#1075;&#1080; IF &#1080; TF, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1083;&#1103; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1103;&#1090;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099;. &#1045;&#1089;&#1083;&#1080; 
&#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1091;&#1076;&#1086;&#1074;&#1083;&#1077;&#1090;&#1074;&#1086;&#1088;&#1103;&#1102;&#1090;&#1089;&#1103; &#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1092;&#1083;&#1072;&#1075;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099;, &#1090;&#1086; 
&#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; 
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;:</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1077;&#1082;;</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1077;&#1082;;</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1077;&#1082;;</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1092;&#1083;&#1072;&#1075;&#1080; IF &#1080; TF.</p>
<p class="MsoPlainText">&nbsp;&#1053;&#1086;&#1074;&#1086;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1080; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082;&#1086;&#1076;&#1072; 
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;. 
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1074; &#1087;&#1088;&#1077;&#1088;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1080;&#1079; 
&#1089;&#1090;&#1077;&#1082;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1076;&#1083;&#1103;:</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089;&#1090;&#1077;&#1082;&#1072;;</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082;&#1086;&#1076;&#1072;;</p>
<p class="MsoPlainText" style="text-indent: 34.0pt; margin-left: 1.45pt">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074;.</p>
<p class="MsoPlainText">&#1040;&#1076;&#1088;&#1077;&#1089; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; 
&#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085; &#1074; &#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1080; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086;&#1076;&#1072;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;. 
&#1050;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1090;&#1080;&#1087;&#1091; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; 0...255, &#1080; &#1072;&#1076;&#1088;&#1077;&#1089; 
&#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1091;&#1090;&#1077;&#1084; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; &#1090;&#1080;&#1087;&#1072; &#1085;&#1072; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; (&#1088;&#1072;&#1079;&#1084;&#1077;&#1088; 
&#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;). &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1074;&#1089;&#1077; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1090; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; 
&#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074;<i> </i>&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;,<i> </i>&#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; 0000<span lang="EN-US">h</span>:0000<span lang="EN-US">h
</span>&#1080; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;.</p>

</body>

</html>
