<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>&#1051;&#1077;&#1082;&#1094;&#1080;&#1103 11</title>
<style>
<!--
p.MsoPlainText
	{margin-bottom:.0001pt;
	text-align:justify;
	text-indent:35.45pt;
	font-size:14.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
-->
</style>
</head>

<body>

<p class="MsoPlainText"><b>11. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1084;</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1050; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1084; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1084; &#1095;&#1072;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090; 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1080; &#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1072;) &#1089; &#1092;&#1083;&#1072;&#1075;&#1072;&#1084;&#1080;. &#1057;&#1088;&#1077;&#1076;&#1080; &#1085;&#1080;&#1093; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; 
&#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077;.</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">CLC </span>&#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1092;&#1083;&#1072;&#1075;&#1072; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; <span lang="EN-US">CF</span>, &#1088;&#1072;&#1074;&#1085;&#1086;&#1077; &#1085;&#1091;&#1083;&#1102;. &#1042;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; 
&#1092;&#1083;&#1072;&#1075;&#1080; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; &#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080;.</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">CMC</span> &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 
&#1092;&#1083;&#1072;&#1075;&#1072; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; <span lang="EN-US">CF </span>&#1085;&#1072; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1077;. &#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1092;&#1083;&#1072;&#1075;&#1080; 
&#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;.</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">STC </span>&#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1092;&#1083;&#1072;&#1075; 
&#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; &#1074; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091;.</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">CLD</span> &#1086;&#1095;&#1080;&#1097;&#1072;&#1077;&#1090; &#1092;&#1083;&#1072;&#1075; 
&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; <span lang="EN-US">DF</span>. &#1042;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1092;&#1083;&#1072;&#1075;&#1080; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; 
&#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; <span lang="EN-US">CLD</span> 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; (<span lang="EN-US">SI
</span>&#1080;&#1083;&#1080; <span lang="EN-US">DI</span>).</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">STD</span> &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1092;&#1083;&#1072;&#1075; 
&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; <span lang="EN-US">DF</span> &#1074; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091;, &#1095;&#1090;&#1086; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; 
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1099;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080; &#1080;&#1093; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1085;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; (<span lang="EN-US">SI
</span>&#1080;&#1083;&#1080; <span lang="EN-US">DI</span>).</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">CLI</span> &#1086;&#1095;&#1080;&#1097;&#1072;&#1077;&#1090; &#1092;&#1083;&#1072;&#1075; 
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;, &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1085;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1077;&#1090; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1084;&#1072;&#1089;&#1082;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077; 
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;.</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">STI </span>&#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1092;&#1083;&#1072;&#1075; 
&#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; <span lang="EN-US">FI </span>&#1074; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080; 
&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; 
&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1089;&#1085;&#1086;&#1074;&#1072; &#1085;&#1077; &#1089;&#1073;&#1088;&#1086;&#1089;&#1080;&#1090; &#1092;&#1083;&#1072;&#1075; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;.</p>

</body>

</html>
