<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>&#1051;&#1077;&#1082;&#1094;&#1080;&#1103 13</title>
<style>
<!--
p.MsoPlainText
	{margin-bottom:.0001pt;
	text-align:justify;
	text-indent:35.45pt;
	font-size:14.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
p.MsoBodyTextIndent
	{margin-bottom:.0001pt;
	text-align:justify;
	text-indent:36.0pt;
	font-size:13.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
p.a1
	{margin-bottom:.0001pt;
	font-size:12.0pt;
	font-family:"Courier New";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
 table.MsoNormalTable
	{mso-style-parent:"";
	font-size:10.0pt;
	font-family:"Times New Roman","serif"}
-->
</style>
</head>

<body>

<p class="MsoPlainText"><b>13. &#1059;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1077; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</b></p>
<p class="MsoBodyTextIndent"><span style="font-size: 12.0pt">&nbsp;</span></p>
<p class="MsoPlainText">&#1071;&#1079;&#1099;&#1082; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074; &#1089;&#1077;&#1073;&#1103; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; 
&#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1059;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1077; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; – &#1091;&#1076;&#1086;&#1073;&#1085;&#1086; &#1087;&#1088;&#1080; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1086;&#1085;&#1072;&#1093; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1054;&#1085;&#1086; &#1076;&#1072;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074; 
&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1080; &#1087;&#1088;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1087;&#1088;&#1086;&#1075;&#1086;&#1085;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1074; 
&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1085;&#1080;&#1093;. &#1050;&#1072;&#1082;&#1086;&#1081; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;, 
&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1090;&#1077;&#1093; &#1080;&#1083;&#1080; &#1080;&#1085;&#1099;&#1093; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1072;&#1074;&#1090;&#1086;&#1088; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1088;&#1086;&#1075;&#1086;&#1085;&#1086;&#1084;. 
&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1072;&#1074;&#1090;&#1086;&#1088;&nbsp; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084; &#1077;&#1077; &#1087;&#1088;&#1086;&#1075;&#1086;&#1085;&#1086;&#1084; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; 
&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1072; &#1074;&#1086;&#1079;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; &#1101;&#1090;&#1091; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1085;&#1072; &#1084;&#1072;&#1082;&#1088;&#1086;&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;.</p>
<p class="MsoPlainText">&#1059;&#1095;&#1072;&#1089;&#1090;&#1086;&#1082; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1079;&#1072;&#1090;&#1088;&#1072;&#1075;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1084; 
&#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; IF-&#1073;&#1083;&#1086;&#1082;&#1072;:</p>
<p class="a1">&lt;<span lang="EN-US">IF</span>-&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1072;&gt;</p>
<p class="a1">&lt;&#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;-1&gt;</p>
<p class="a1"><span lang="EN-US">ELSE</span></p>
<p class="a1">&lt;&#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;-2&gt;</p>
<p class="a1"><span lang="EN-US">ENDIF</span></p>
<p class="MsoPlainText" style="text-indent: 0cm">&#1080;&#1083;&#1080;</p>
<p class="a1">&lt;<span lang="EN-US">IF</span>-&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1072;&gt;</p>
<p class="a1">&lt;&#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;-1&gt;</p>
<p class="a1"><span lang="EN-US">ENDIF</span></p>
<p class="MsoPlainText">&#1044;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; ELSE &#1080; ENDIF &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; 
&#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1093;. &#1042; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1078;&#1077; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1083;&#1102;&#1073;&#1099;&#1093; 
&#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1085;&#1080;&#1093; &#1089;&#1085;&#1086;&#1074;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; IF-&#1073;&#1083;&#1086;&#1082;&#1080;, &#1090;. &#1077;. &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; 
&#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; IF-&#1073;&#1083;&#1086;&#1082;&#1086;&#1074;.</p>
<p class="MsoPlainText">&#1042; IF-&#1076;&#1080;&#1088;&#1089;&#1082;&#1090;&#1080;&#1074;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; 
&#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1072;&#1082;&#1088;&#1086;&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086;, &#1090;&#1086; &#1084;&#1072;&#1082;&#1088;&#1086;&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; 
&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;-1, &#1072; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;-2 
&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;, &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1080;&#1090; &#1074; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1078;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1085;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086;, 
&#1090;&#1086;&#1075;&#1076;&#1072; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;-1 &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1072; &#1074; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 
&#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;-2. &#1045;&#1089;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1080; ELSE &#1085;&#1077;&#1090;, &#1090;&#1086; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;-2 &#1087;&#1091;&#1089;&#1090;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1088;&#1080; 
&#1085;&#1077;&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1090;&#1072;&#1082;&#1086;&#1081; IF-&#1073;&#1083;&#1086;&#1082; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; «&#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;» &#1074; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.</p>
<p class="MsoPlainText">&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1074; IF-&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1101;&#1090;&#1072;&#1087;&#1077; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1090;&#1086; &#1074; &#1085;&#1077;&#1084; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1072; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1090;&#1072;&#1085;&#1091;&#1090; 
&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1084;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1080; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; 
&#1085;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1080;&#1083;&#1080; &#1103;&#1095;&#1077;&#1077;&#1082; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;). &#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; 
&#1090;&#1072;&#1082;&#1080;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1072;&#1082;&#1088;&#1086;&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1084;&#1086;&#1075; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089;&#1088;&#1072;&#1079;&#1091;, &#1082;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1089;&#1090;&#1088;&#1077;&#1090;&#1080;&#1090; (&#1074; &#1085;&#1077;&#1084; 
&#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1074;&#1087;&#1077;&#1088;&#1077;&#1076;).</p>
<p class="MsoPlainText">&#1042; &#1084;&#1072;&#1082;&#1088;&#1086;&#1103;&#1079;&#1099;&#1082;&#1077; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; IF-&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074; &#1080;&#1093; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086; 
&#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1080;, &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1102;&#1090; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077; 
&#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;.</p>
<p class="MsoPlainText">&#1044;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; IF &#1080; IFE &#1080;&#1084;&#1077;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074;&#1080;&#1076;:</p>
<p class="a1"><span lang="EN-US">IF</span> &lt;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; </p>
<p class="a1"><span lang="EN-US">IFE</span> &lt;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt;</p>
<p class="MsoPlainText">&#1042;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1103; &#1083;&#1102;&#1073;&#1091;&#1102; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;, &#1084;&#1072;&#1082;&#1088;&#1086;&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; 
&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1074; &#1085;&#1077;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;. &#1042; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; IF &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; 
&#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086; &#1086;&#1090; 0, &#1072; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; IFE - 
&#1077;&#1089;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; 0.</p>
<p class="MsoPlainText">&#1042; &#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1077; &#1074; 
&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1072;&#1093; IF &#1080; IFE, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1083;&#1102;&#1073;&#1099;&#1084;, &#1085;&#1086; &#1087;&#1086; &#1089;&#1084;&#1099;&#1089;&#1083;&#1091; &#1086;&#1085;&#1086;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; 
&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1042; &#1103;&#1079;&#1099;&#1082;&#1077; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1096;&#1077;&#1089;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103;:</p>
<p class="a1">&lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; <span lang="EN-US">EQ</span> &lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; </p>
<p class="a1">&lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; <span lang="EN-US">NE</span> &lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; </p>
<p class="a1">&lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; <span lang="EN-US">LT</span> &lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt;</p>
<p class="a1">&lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; <span lang="EN-US">LE</span> &lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt;</p>
<p class="a1">&lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; <span lang="EN-US">GT</span> &lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt;</p>
<p class="a1">&lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; <span lang="EN-US">GE</span> &lt;&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt;</p>
<p class="MsoPlainText">&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;: EQ -&#1088;&#1072;&#1074;&#1085;&#1086;, NE&nbsp; - &#1085;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086;, LT 
- &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;, LE -&#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1074;&#1085;&#1086;, GT - &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, GE - &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1074;&#1085;&#1086;. &#1054;&#1073;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072; 
&#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1083;&#1080;&#1073;&#1086; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1099;&#1084;&#1080; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1083;&#1080;&#1073;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1099;&#1084;&#1080; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1073;&#1103;&#1079;&#1072;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1080;&#1079; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. &#1045;&#1089;&#1083;&#1080; 
&#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1084;&#1086;&#1077; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; «&#1080;&#1089;&#1090;&#1080;&#1085;&#1072;», &#1085;&#1077; 
&#1077;&#1089;&#1083;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; – «&#1083;&#1086;&#1078;&#1100;». </p>
<p class="MsoPlainText">&#1051;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1100; &#1074; &#1073;&#1086;&#1083;&#1077;&#1077; 
&#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;:</p>
<p class="a1">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">NOT</span>&nbsp; 
&lt;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt;</p>
<p class="a1">&lt;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; <span lang="EN-US">AND</span>&nbsp; 
&lt;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; </p>
<p class="a1">&lt;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; &nbsp;&nbsp;&nbsp; <span lang="EN-US">OR</span>&nbsp;&nbsp; 
&lt;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; </p>
<p class="a1">&lt;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt; &nbsp;&nbsp;&nbsp; <span lang="EN-US">XOR</span>&nbsp; 
&lt;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&gt;</p>
<p class="MsoPlainText">&#1069;&#1090;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; 
&#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1085;&#1098;&#1102;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1076;&#1080;&#1079;&#1098;&#1102;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080; «&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1048;&#1051;&#1048;». &#1048;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072;&#1084;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; 
&#1083;&#1102;&#1073;&#1099;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1085;&#1099;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1085;&#1086; &#1085;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077;), &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1090;&#1088;&#1072;&#1082;&#1090;&#1091;&#1102;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; 
16-&#1073;&#1080;&#1090;&#1086;&#1074;&#1099;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1101;&#1090;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1090;&#1072;&#1082;&#1078;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; 16-&#1073;&#1080;&#1090;&#1086;&#1074;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086;, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1087;&#1086;&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;. </p>
<p class="MsoPlainText">&#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;. &#1053;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1091;&#1090;&#1072;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;: 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1080; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074; &#1080; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;<span style="color: lime">
</span>&#1101;&#1090;&#1072;&#1087;&#1077; &#1090;&#1088;&#1072;&#1085;&#1089;&#1083;&#1103;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; (&#1074; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1080;&#1093; &#1085;&#1077;&#1090;), &#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; 
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; &#1101;&#1090;&#1072;&#1087;&#1077; &#1089;&#1095;&#1077;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.</p>
<p class="MsoPlainText">&#1044;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; IFIDN, IFDIF, IFB &#1080; IFNB &#1080;&#1084;&#1077;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074;&#1080;&#1076;:</p>
<p class="a1"><span lang="EN-US">IFIDN &lt;tl&gt;,&lt;t2&gt; </span></p>
<p class="a1"><span lang="EN-US">IFDIF &lt;tl&gt;,&lt;t2&gt;</span></p>
<p class="MsoPlainText" style="text-indent: 0cm">&#1075;&#1076;&#1077; tl &#1080; t2 - &#1083;&#1102;&#1073;&#1099;&#1077; 
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; (&#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1086;&#1085;&#1080; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099; &#1074; 
&#1091;&#1075;&#1083;&#1086;&#1074;&#1099;&#1077; &#1089;&#1082;&#1086;&#1073;&#1082;&#1080;), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;. &#1042; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; IFIDN &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; 
&#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1088;&#1072;&#1074;&#1085;&#1099;, &#1072; &#1074; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; IFDIF - &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1085;&#1077; 
&#1088;&#1072;&#1074;&#1085;&#1099;. &#1055;&#1088;&#1080; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1080; &#1101;&#1090;&#1080;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1080; &#1084;&#1072;&#1083;&#1099;&#1077; &#1073;&#1091;&#1082;&#1074;&#1099; &#1085;&#1077; &#1086;&#1090;&#1086;&#1078;&#1076;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;.</p>
<p class="MsoPlainText">&#1054;&#1073;&#1077; &#1101;&#1090;&#1080; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1080;&#1096;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; 
&#1090;&#1077;&#1083;&#1072;<span style="color: lime"> </span>&#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1103; &#1074; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;&#1093; 
&#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;. &#1055;&#1088;&#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1087;&#1086;&#1076;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1101;&#1090;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; 
&#1079;&#1072;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1080; &#1101;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1099; &#1083;&#1080; &#1087;&#1088;&#1080; 
&#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1080; &#1082; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1091; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;.</p>
<p class="MsoPlainText">&#1044;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099;</p>
<p class="a1"><span lang="EN-US">IFB</span> &lt;<span lang="EN-US">t</span>&gt;</p>
<p class="a1"><span lang="EN-US">IFNB</span> &lt;<span lang="EN-US">t</span>&gt;</p>
<p class="MsoPlainText">&#1060;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072;&#1084;&#1080; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074; IF<span lang="EN-US">I</span>DN 
&#1080; IFDIF, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1091;&#1089;&#1090;. &#1042; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; IFB &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;, 
&#1077;&#1089;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090; t &#1087;&#1091;&#1089;&#1090;, &#1072; &#1074; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; IFNB - &#1077;&#1089;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090; t &#1085;&#1077; &#1087;&#1091;&#1089;&#1090;.</p>
<p class="MsoPlainText">&#1069;&#1090;&#1080; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1072;&#1093; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080;, 
&#1079;&#1072;&#1076;&#1072;&#1085; &#1083;&#1080; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;.</p>
<p class="MsoPlainText">&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; 
&#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.</p>
<p class="MsoPlainText">&#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1086;&#1090;&#1083;&#1072;&#1076;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1080; &#1076;&#1083;&#1103; 
&#1101;&#1090;&#1086;&#1075;&#1086; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1084;&#1077;&#1089;&#1090;&#1072; &#1077;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090;&#1083;&#1072;&#1076;&#1086;&#1095;&#1085;&#1099;&#1077; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080; (&#1054;&#1055;), &#1090;. &#1077;. 
&#1087;&#1077;&#1095;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1084;&#1077;&#1078;&#1091;&#1090;&#1086;&#1095;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1080; &#1054;&#1055; 
&#1091;&#1073;&#1080;&#1088;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080;&#1079; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1055;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;. &#1042;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; 
&#1080; &#1091;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100; &#1054;&#1055; &#1084;&#1086;&#1078;&#1085;&#1086;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086;-&#1083;&#1080;&#1073;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1072;, &#1085;&#1086; &#1095;&#1072;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1054;&#1055; 
&#1088;&#1072;&#1079;&#1073;&#1088;&#1086;&#1089;&#1072;&#1085;&#1099; &#1087;&#1086; &#1074;&#1089;&#1077;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;, &#1080;<span style="color: lime"> </span>&#1101;&#1090;&#1086; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1085;&#1077; 
&#1084;&#1072;&#1083;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;. &#1042; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; 
&#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;: &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&nbsp; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1054;&#1055;, &#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; 
&#1080;&#1079; &#1085;&#1080;&#1093; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1054;&#1055; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; 
&#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1077;.</p>
<p class="MsoPlainText">&#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;. &#1055;&#1091;&#1089;&#1090;&#1100; &#1088;&#1077;&#1078;&#1080;&#1084; 
&#1087;&#1088;&#1086;&#1075;&#1086;&#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1099; DEBUG, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1074; 
&#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 1 (&#1086;&#1090;&#1083;&#1072;&#1076;&#1082;&#1072;) &#1080;&#1083;&#1080; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 0 (&#1089;&#1095;&#1077;&#1090;). &#1058;&#1086;&#1075;&#1076;&#1072;, (&#1089;&#1084;. &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;) &#1091;&#1095;&#1072;&#1089;&#1090;&#1086;&#1082; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1089; &#1086;&#1090;&#1083;&#1072;&#1076;&#1086;&#1095;&#1085;&#1086;&#1081; 
&#1087;&#1077;&#1095;&#1072;&#1090;&#1100;&#1102; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; X) &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1089;&#1083;&#1077;&#1074;&#1072;, &#1074; 
&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1078;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1101;&#1090;&#1086;&#1090; &#1091;&#1095;&#1072;&#1089;&#1090;&#1086;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; 
&#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; (<span lang="EN-US">PRINT</span> – &#1084;&#1072;&#1082;&#1088;&#1086;&#1089; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1085;&#1072;<span style="color: lime">
</span>&#1101;&#1082;&#1088;&#1072;&#1085;):</p>
<table class="MsoNormalTable" border="0" cellspacing="0" cellpadding="0" style="border-collapse: collapse; margin-left: 5.4pt">
	<tr>
		<td width="283" valign="top" style="width: 212.6pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a1"><span lang="EN-US">…</span></p>
		<p class="a1"><span lang="EN-US">MOV &#1061;,&#1040;&#1061;</span></p>
		<p class="a1"><span lang="EN-US">IF DEBUG </span></p>
		<p class="a1"><span lang="EN-US">PRINT X </span></p>
		<p class="a1"><span lang="EN-US">ENDIF </span></p>
		<p class="a1"><span lang="EN-US">MOV BX,0</span></p>
		<p class="a1"><span lang="EN-US">…</span></td>
		<td width="284" valign="top" style="width: 212.65pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="a1"><span lang="EN-US">Debug&lt;&gt;0</span></p>
		<p class="a1" style="margin-left: 30.1pt"><span lang="EN-US">…</span></p>
		<p class="a1" style="margin-left: 30.1pt"><span lang="EN-US">MOV X,AX
		</span></p>
		<p class="a1" style="margin-left: 30.1pt"><span lang="EN-US">PRINT X
		</span></p>
		<p class="a1" style="margin-left: 30.1pt"><span lang="EN-US">MOV BX,0</span></p>
		<p class="a1" style="margin-left: 30.1pt"><span lang="EN-US">…</span></p>
		<p class="a1"><span lang="EN-US">Debug=0</span></p>
		<p class="a1" style="margin-left: 30.1pt"><span lang="EN-US">MOV X,AX
		</span></p>
		<p class="a1" style="margin-left: 30.1pt"><span lang="EN-US">MOV BX,0</span></p>
		<p class="a1" style="margin-left: 30.1pt"><span lang="EN-US">…</span></td>
	</tr>
</table>
<p class="MsoPlainText">&#1055;&#1088;&#1080; &#1090;&#1072;&#1082;&#1086;&#1084; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; 
&#1077;&#1077; &#1087;&#1088;&#1086;&#1075;&#1086;&#1085;&#1086;&#1084; &#1087;&#1086;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1083;&#1080;&#1096;&#1100; &#1086;&#1076;&#1085;&#1091; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1091; – &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1099; DEBUG,<span style="color: lime">
</span>&#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1072;&#1082;&#1088;&#1086;&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1089;&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083; &#1088;&#1072;&#1079;&#1085;&#1099;&#1081; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; (&#1089; 
&#1054;&#1055; &#1080;&#1083;&#1080; &#1073;&#1077;&#1079; &#1085;&#1080;&#1093;).</p>
<p class="MsoPlainText">&#1042;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1054;&#1055; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080; &#1089; 
&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1077; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&nbsp; &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1054;&#1055; 
&#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;, &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;<span style="color: lime"> </span>&#1074;&#1089;&#1077;&#1075;&#1076;&#1072; 
&#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1084;&#1077;&#1089;&#1090;&#1086; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; 
&#1054;&#1055; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;, &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1080; &#1085;&#1072; &#1101;&#1090;&#1086; &#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1089;&#1103; &#1074;&#1088;&#1077;&#1084;&#1103;. 
&#1055;&#1088;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1084; &#1078;&#1077; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1054;&#1055;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1099;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1099; &#1080;&#1079; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;&nbsp; &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1084;&#1077;&#1089;&#1090;&#1086; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1090;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072; 
&#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;. </p>

</body>

</html>
