<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>&#1051;&#1077;&#1082;&#1094;&#1080;&#1103 14</title>
<style>
<!--
p.MsoPlainText
	{margin-bottom:.0001pt;
	text-align:justify;
	text-indent:35.45pt;
	font-size:14.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
p.a0
	{margin-bottom:.0001pt;
	font-size:12.0pt;
	font-family:"Courier New";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
-->
</style>
</head>

<body>

<p class="MsoPlainText"><b>14. &#1052;&#1072;&#1082;&#1088;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1052;&#1072;&#1082;&#1088;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1103;&#1079;&#1099;&#1082;&#1072; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; 
&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; (&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;), &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086; &#1086;&#1073;&#1097;&#1077;&#1077; &#1080;&#1084;&#1103;, 
&#1080; &#1079;&#1072;&#1090;&#1077;&#1084; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1080;&#1084;&#1103; &#1076;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1072;. &#1042; 
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1079;&#1072;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1074;&#1072;&#1077;&#1084;&#1086;&#1077; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1080;&#1084;&#1103; (&#1084;&#1072;&#1082;&#1088;&#1086;&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;) &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1095;&#1077;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1084;&#1072;&#1082;&#1088;&#1086;&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;. </p>
<p class="MsoPlainText">&#1052;&#1072;&#1082;&#1088;&#1086;&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; 
&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;. &#1052;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; 
&#1087;&#1088;&#1077;&#1076;&#1096;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084;&#1091; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1074; &#1084;&#1072;&#1082;&#1088;&#1086;&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077;. &#1052;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; 
&#1082;&#1072;&#1082; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1090;&#1072;&#1082; &#1080; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; 
&#1092;&#1072;&#1081;&#1083;&#1072; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; INCLUDE. &#1042; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1099; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1084;&#1072;&#1082;&#1088;&#1086;&#1087;&#1086;&#1076;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1086;&#1081; &#1080;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. </p>
<p class="MsoPlainText">&#1042; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1084;&#1072;&#1082;&#1088;&#1086;&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090; &#1074; 
&#1094;&#1077;&#1083;&#1086;&#1084; &#1090;&#1077; &#1078;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1095;&#1090;&#1086; &#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099;, &#1090;.&#1077;. &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1077; &#1080; 
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1089; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1056;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1077; 
&#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084;:</p>
<p class="MsoPlainText" style="margin-left: 0cm">1)<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;
</span>&#1055;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1082;&#1072;&#1082; &#1090;&#1077;&#1083;&#1086; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;, &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1084;&#1072;&#1082;&#1088;&#1086;&#1082;&#1086;&#1084;&#1072;&#1085;&#1076; 
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;.</p>
<p class="MsoPlainText" style="margin-left: 0cm">2)<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;
</span>&#1058;&#1077;&#1082;&#1089;&#1090; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1085; &#1080; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085; &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1082;&#1072;&#1082; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1077;&#1090;&#1100; &#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1084;&#1072;&#1082;&#1088;&#1086;&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. </p>
<p class="MsoPlainText">&#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1084;&#1072;&#1082;&#1088;&#1086;&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; - &#1101;&#1090;&#1086; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1090;&#1086; 
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1083;&#1080;&#1096;&#1100; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.</p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText"><b>14.1. &#1052;&#1072;&#1082;&#1088;&#1086;&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099;</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&nbsp;&#1052;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1073;&#1083;&#1086;&#1082; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; 
&#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; MACRO &#1080; &#1079;&#1072;&#1082;&#1072;&#1085;&#1095;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; ENDM. 
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;:</p>
<p class="a0">&#1080;&#1084;&#1103; <span lang="EN-US">MACRO</span> [[&#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;-&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;,...]]</p>
<p class="a0">&#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</p>
<p class="a0"><span lang="EN-US">ENDM</span></p>
<p class="MsoPlainText">&#1048;&#1084;&#1077;&#1085;&#1077;&#1084; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1084;&#1103;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1074; 
&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; MACRO. &#1054;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; 
&#1092;&#1072;&#1081;&#1083;&#1077; &#1076;&#1083;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; 
&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1087;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1102; &#1082; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1102; &#1080;&#1084;&#1077;&#1085;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; 
&#1076;&#1083;&#1103; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1074; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1077;&#1075;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;. &#1052;&#1086;&#1078;&#1077;&#1090; 
&#1073;&#1099;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086; &#1083;&#1102;&#1073;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1085;&#1086; &#1074;&#1089;&#1077; &#1086;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; 
&#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072;&#1087;&#1103;&#1090;&#1099;&#1084;&#1080;. </p>
<p class="MsoPlainText">&#1042; &#1090;&#1077;&#1083;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099; &#1083;&#1102;&#1073;&#1099;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; 
&#1103;&#1079;&#1099;&#1082;&#1072; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072;, &#1074; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086; &#1083;&#1102;&#1073;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; 
&#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1072; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085; &#1083;&#1102;&#1073;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1088;&#1072;&#1079; 
&#1074; &#1101;&#1090;&#1080;&#1093; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093;.</p>
<p class="MsoPlainText">&#1052;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077;&#1090; 
&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1073; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1080; &#1080;&#1079; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; 
&#1079;&#1072;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089; &#1090;&#1077;&#1084; &#1078;&#1077; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;. </p>
<p class="MsoPlainText">&#1052;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1086; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; 
&#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; &#1077;&#1075;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077;. &#1040;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1077;&#1090; 
&#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; &#1090;&#1086;&#1095;&#1082;&#1091; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072;, &#1079;&#1072;&#1084;&#1077;&#1097;&#1072;&#1103; &#1074; &#1101;&#1090;&#1080;&#1093; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; 
&#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1085;&#1072; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;.</p>
<p class="MsoPlainText">&#1054;&#1073;&#1097;&#1080;&#1081; &#1074;&#1080;&#1076; &#1084;&#1072;&#1082;&#1088;&#1086;&#1074;&#1099;&#1079;&#1086;&#1074;&#1072;:</p>
<p class="a0">&#1080;&#1084;&#1103; [[&#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081;-&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;,...]]</p>
<p class="MsoPlainText">&#1048;&#1084;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1088;&#1072;&#1085;&#1077;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; 
&#1092;&#1072;&#1081;&#1083;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1060;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1084;&#1103;, &#1095;&#1080;&#1089;&#1083;&#1086; &#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086; &#1083;&#1102;&#1073;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1085;&#1086; &#1074;&#1089;&#1077; &#1086;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; 
&#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077;. &#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; 
&#1079;&#1072;&#1087;&#1103;&#1090;&#1099;&#1084;&#1080;, &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1072;&#1084;&#1080;, &#1080;&#1083;&#1080; TAB-&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;&#1084;&#1080;.</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088; &#1079;&#1072;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; 
&#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;, &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; 
&#1080; &#1090;.&#1076;. &#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1074; &#1084;&#1072;&#1082;&#1088;&#1086;&#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; 
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1074; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080;, &#1083;&#1080;&#1096;&#1085;&#1080;&#1077; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;. &#1045;&#1089;&#1083;&#1080; 
&#1078;&#1077; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1076;&#1083;&#1103; 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1099; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077;, &#1079;&#1072;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1091;&#1089;&#1090;&#1099;&#1084;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1084;&#1080; (&#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1072;&#1084;&#1080;). &#1044;&#1083;&#1103; 
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1099; &#1080;&#1083;&#1080; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1099; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; 
&#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; IFB &#1080; IFNB (&#1089;&#1084;. «13. &#1059;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1077; 
&#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;»).</p>
<p class="MsoPlainText">&nbsp;&#1042; &#1084;&#1072;&#1082;&#1088;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; 
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;. &#1069;&#1090;&#1086;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; 
&#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1074; &#1086;&#1076;&#1080;&#1085;&#1072;&#1088;&#1085;&#1099;&#1077; &#1091;&#1075;&#1083;&#1086;&#1074;&#1099;&#1077; &#1089;&#1082;&#1086;&#1073;&#1082;&#1080; &lt; &gt;, &#1072; &#1089;&#1072;&#1084;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; – &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; 
&#1079;&#1072;&#1087;&#1103;&#1090;&#1099;&#1084;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:</p>
<p class="a0"><span lang="EN-US">allocb</span> &lt;1,2,3,4&gt;</p>
<p class="MsoPlainText">&nbsp;&#1055;&#1088;&#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1081; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090; 
&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1080; &#1084;&#1077;&#1090;&#1086;&#1082; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1081; &#1080;&#1083;&#1080; &#1080;&#1084;&#1077;&#1085; &#1087;&#1086;&#1083;&#1077;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;, &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1102;&#1090; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; 
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1084;&#1077;&#1085; &#1080;&#1083;&#1080; &#1084;&#1077;&#1090;&#1086;&#1082; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;&#1090; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091; &#1090;&#1088;&#1072;&#1085;&#1089;&#1083;&#1103;&#1094;&#1080;&#1080;. 
&#1044;&#1083;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1081; &#1074; &#1084;&#1072;&#1082;&#1088;&#1086;&#1103;&#1079;&#1099;&#1082;&#1077; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1072; 
&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1072; LOCAL, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1072;&#1103; &#1083;&#1086;&#1082;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1080;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;:</p>
<p class="a0"><span lang="EN-US">LOCAL</span> &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;_&#1080;&#1084;&#1103;,...</p>
<p class="MsoPlainText">&#1060;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;_&#1080;&#1084;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1089; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1084;&#1072;&#1082;&#1088;&#1086;&#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1077;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; 
&#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;. &#1042; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077; LOCAL, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1072; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1086; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; 
&#1086;&#1076;&#1085;&#1086; &#1080;&#1084;&#1103;, &#1072; &#1077;&#1089;&#1083;&#1080; &#1080;&#1093; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086;, &#1086;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072;&#1087;&#1103;&#1090;&#1099;&#1084;&#1080;. &#1044;&#1083;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; 
&#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; LOCAL &#1080;&#1084;&#1077;&#1085; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; 
&#1080;&#1084;&#1077;&#1085;&#1080; &#1087;&#1088;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1084;&#1072;&#1082;&#1088;&#1086;&#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1087;&#1086;&#1088;&#1086;&#1078;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1074;&#1080;&#1076;&#1072;:</p>
<p class="a0">??&#1085;&#1086;&#1084;&#1077;&#1088;</p>
<p class="MsoPlainText">&#1053;&#1086;&#1084;&#1077;&#1088; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; 16-&#1088;&#1080;&#1095;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1086;&#1090; 
0000 &#1076;&#1086; FFFF. &#1044;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1090;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1075;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1085; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1091; &#1085;&#1077; 
&#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1074; &#1089;&#1074;&#1086;&#1077;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;.</p>
<p class="MsoPlainText">&nbsp;&#1044;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1072; LOCAL &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080;, &#1087;&#1088;&#1080;&#1095;&#1077;&#1084;, &#1090;&#1072;&#1084; &#1086;&#1085;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1096;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077;&#1084; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1090;.&#1077;. &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; MACRO.</p>
<p class="MsoPlainText">&#1044;&#1083;&#1103; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1081; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1072; PURGE. 
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;:</p>
<p class="a0"><span lang="EN-US">PURGE</span> &#1080;&#1084;&#1103;_&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;,...</p>
<p class="MsoPlainText">&#1044;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; PURGE &#1091;&#1076;&#1072;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1077; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; 
&#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1080;&#1084;&#1077;&#1085;&#1072;&#1084;&#1080;. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074;&#1099;&#1079;&#1086;&#1074; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; 
&#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1082; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1080;&#1084;&#1103;-&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1084;&#1085;&#1077;&#1084;&#1086;&#1085;&#1080;&#1082;&#1091; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; 
&#1080;&#1083;&#1080; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099;, &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1084;&#1099;&#1089;&#1083; &#1084;&#1085;&#1077;&#1084;&#1086;&#1085;&#1080;&#1082;&#1080; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; 
&#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;. &#1044;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1072; PURGE &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; 
&#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1085;&#1091;&#1078;&#1085;&#1099;&#1093; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1081; &#1080;&#1079; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1084;&#1086;&#1081; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; INCLUDE &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1081;. &#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1081; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1081; 
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;, &#1074; &#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; 
&#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1081;. &#1050;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074; INCLUDE &#1080; PURGE &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1080;&#1079; &#1085;&#1080;&#1093; 
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1091;&#1078;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1082;&#1088;&#1072;&#1090;&#1080;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;.</p>
<p class="MsoPlainText">&#1042;&#1099;&#1093;&#1086;&#1076; &#1080;&#1079; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; 
&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; ENDM &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; EXITM, &#1080;&#1084;&#1077;&#1102;&#1097;&#1077;&#1081; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;:</p>
<p class="a0"><span lang="EN-US">EXITM</span></p>
<p class="MsoPlainText">&#1042;&#1099;&#1093;&#1086;&#1076; &#1080;&#1079; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1072;&#1084; ENDM &#1080; EXITM 
&#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1084;&#1072;&#1082;&#1088;&#1086;&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1077; &#1074; &#1090;&#1086;&#1095;&#1082;&#1091; 
&#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1084; &#1084;&#1072;&#1082;&#1088;&#1086;&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; &#1074; 
&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;:</p>
<p class="a0"><span lang="EN-US">add</span>&nbsp; <span lang="EN-US">MACRO</span>&nbsp;&nbsp;&nbsp;
<span lang="EN-US">param</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">IFB</span>&nbsp; <span lang="EN-US">param</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">EXITM</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">ENDIF</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">ADD</span>&nbsp; <span lang="EN-US">AX</span>,<span lang="EN-US">param</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">ENDM</span></p>
<p class="MsoPlainText">&nbsp;&#1042; &#1101;&#1090;&#1086;&#1084; &#1084;&#1072;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; 
&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1099;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; param, &#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1084;&#1091; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; AX. 
&#1041;&#1083;&#1086;&#1082; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; IFB &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1099;&#1093;&#1086;&#1076; &#1080;&#1079; &#1084;&#1072;&#1082;&#1088;&#1086;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1085;&#1080;&#1103;, &#1077;&#1089;&#1083;&#1080; 
&#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1077; &#1073;&#1099;&#1083; &#1079;&#1072;&#1076;&#1072;&#1085;.</p>

</body>

</html>
