<html xmlns:v="urn:schemas-microsoft-com:vml" xmlns:o="urn:schemas-microsoft-com:office:office" xmlns="http://www.w3.org/TR/REC-html40">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<link rel="File-List" href="3.files/filelist.xml">
<title>&#1051;&#1077;&#1082;&#1094;&#1080;&#1103 3</title>
<style>
<!--
p.FR1
	{mso-style-parent:"";
	margin-top:0cm;
	margin-right:10.0pt;
	margin-bottom:0cm;
	margin-left:76.0pt;
	margin-bottom:.0001pt;
	font-size:9.0pt;
	font-family:"Times New Roman","serif";
	layout-grid-mode:line}
p.Normal
	{mso-style-parent:"";
	margin-bottom:.0001pt;
	text-align:justify;
	text-indent:15.0pt;
	font-size:11.0pt;
	font-family:"Times New Roman","serif";
	layout-grid-mode:line; margin-left:0cm; margin-right:0cm; margin-top:0cm}
-->
</style>
<!--[if !mso]>
<style>
v\:*         { behavior: url(#default#VML) }
o\:*         { behavior: url(#default#VML) }
.shape       { behavior: url(#default#VML) }
</style>
<![endif]--><!--[if gte mso 9]>
<xml><o:shapedefaults v:ext="edit" spidmax="1027"/>
</xml><![endif]-->
</head>

<body>

<p class="FR1" style="text-align: justify; text-indent: 35.45pt; margin-left: 0cm">
<b><span style="font-size: 14.0pt">3. &#1040;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;, &#1084;&#1072;&#1082;&#1088;&#1086;&#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;, &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1089;&#1074;&#1103;&#1079;&#1077;&#1081;</span></b></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt">&nbsp;</span></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt">
&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;. &#1054;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1093; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1072;&#1082;&#1077;&#1090; </span><span lang="EN-US" style="font-size: 14.0pt">
Turbo Assembler</span><span style="font-size: 14.0pt">, &#1074;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; 
&#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1089;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; </span><span lang="EN-US" style="font-size: 14.0pt">Borland</span><span style="font-size: 14.0pt"> 
&#1057;++. &#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1089; &#1101;&#1090;&#1080;&#1084; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;.</span></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt">
&#1042;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1076;&#1083;&#1103; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; (</span><span lang="EN-US" style="font-size: 14.0pt">TASM</span><span style="font-size: 14.0pt">.</span><span lang="EN-US" style="font-size: 14.0pt">EXE</span><span style="font-size: 14.0pt">) 
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; — &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1074; &#1082;&#1086;&#1076;&#1072;&#1093; </span>
<span lang="EN-US" style="font-size: 14.0pt">ASCII</span><span style="font-size: 14.0pt">. 
&#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1076;&#1086; 3-&#1093; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;:</span></p>
<p class="Normal" style="text-indent: 35.45pt; margin-left: 0cm">
<span style="font-size: 14.0pt">1)<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;
</span>&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; – &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, 
&#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093;; </span></p>
<p class="Normal" style="text-indent: 35.45pt; margin-left: 0cm">
<span style="font-size: 14.0pt">2)<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;
</span>&#1083;&#1080;&#1089;&#1090;&#1080;&#1085;&#1075;&#1086;&#1074;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; – &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1084; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1074; &#1082;&#1086;&#1076;&#1072;&#1093; </span>
<span lang="EN-US" style="font-size: 14.0pt">ASCII</span><span style="font-size: 14.0pt">, 
&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1097;&#1080;&#1084; &#1082;&#1072;&#1082; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1090;&#1072;&#1082; &#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072;;</span></p>
<p class="Normal" style="text-indent: 35.45pt; margin-left: 0cm">
<span style="font-size: 14.0pt">3)<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;
</span>&#1092;&#1072;&#1081;&#1083; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1077;&#1089;&#1090;&#1085;&#1099;&#1093; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; – &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086;&#1073; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; 
&#1080; &#1084;&#1077;&#1090;&#1086;&#1082; &#1074; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; (&#1087;&#1077;&#1088;&#1077;&#1076; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1101;&#1090;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1072; 
&#1077;&#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081; </span><span lang="EN-US" style="font-size: 14.0pt">
CREF</span><span style="font-size: 14.0pt">).</span></p>
<p class="Normal" style="text-indent: 35.4pt"><span style="font-size: 14.0pt">
&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;&#1084;&#1091; &#1092;&#1072;&#1081;&#1083;&#1091; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1086; &#1078;&#1077; &#1080;&#1084;&#1103;, &#1095;&#1090;&#1086; &#1080; &#1091; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;, &#1085;&#1086; &#1089; 
&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; </span><span lang="EN-US" style="font-size: 14.0pt">OBJ</span><span style="font-size: 14.0pt">; 
&#1076;&#1083;&#1103; &#1083;&#1080;&#1089;&#1090;&#1080;&#1085;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1077;&#1089;&#1090;&#1085;&#1099;&#1093; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; </span>
<span lang="EN-US" style="font-size: 14.0pt">NUL</span><span style="font-size: 14.0pt"> 
— &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1090;&#1080;&#1087; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1074;&#1089;&#1077;, &#1095;&#1090;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1080; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; 
&#1073;&#1099;&#1090;&#1100; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086;.</span></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt">
&#1045;&#1089;&#1083;&#1080; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1086;&#1085; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; 
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086; &#1085;&#1080;&#1093; &#1074; &#1083;&#1080;&#1089;&#1090;&#1080;&#1085;&#1075;&#1086;&#1074;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1086;&#1085; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1080;&#1093; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1103;.
</span></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt">
&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1072;&#1103; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;), &#1077;&#1097;&#1077; &#1085;&#1077; 
&#1075;&#1086;&#1090;&#1086;&#1074;&#1072; &#1082; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1102;. &#1045;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1074;&#1103;&#1079;&#1077;&#1081;
</span><span lang="EN-US" style="font-size: 14.0pt">TLINK</span><span style="font-size: 14.0pt">, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1074;&#1103;&#1079;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1074; &#1086;&#1076;&#1085;&#1091; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1080; 
&#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1086;&#1095;&#1085;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;.</span></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt">
&#1042;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; </span>
<span lang="EN-US" style="font-size: 14.0pt">TLINK</span><span style="font-size: 14.0pt"> 
&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1080;&#1084;&#1077;&#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; (&#1092;&#1072;&#1081;&#1083;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1073;&#1077;&#1079; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; OBJ). 
&#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;, &#1090;&#1086; &#1080;&#1093; &#1080;&#1084;&#1077;&#1085;&#1072; &#1074;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100; «+». &#1052;&#1086;&#1076;&#1091;&#1083;&#1080; 
&#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1074; &#1082;&#1072;&#1082;&#1086;&#1084; &#1080;&#1093; &#1080;&#1084;&#1077;&#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; </span>
<span lang="EN-US" style="font-size: 14.0pt">TLINK</span><span style="font-size: 14.0pt">. 
&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, </span><span lang="EN-US" style="font-size: 14.0pt">TLINK</span><span style="font-size: 14.0pt"> 
&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1085;&#1080; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1077;&#1084;&#1091; 
&#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1084;&#1103; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1080;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1099;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081;, &#1085;&#1086; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; &#1045;&#1061;&#1045;. &#1044;&#1072;&#1083;&#1077;&#1077; 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1076;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1088;&#1090;&#1099; &#1089;&#1074;&#1103;&#1079;&#1077;&#1081; (&#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; 
&#1082;&#1072;&#1088;&#1090;&#1099; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;). &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077;, &#1095;&#1090;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; </span>
<span lang="EN-US" style="font-size: 14.0pt">TLINK</span><span style="font-size: 14.0pt"> 
– &#1101;&#1090;&#1086; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099; &#1074; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080; 
&#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1090;&#1072;&#1082;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;.</span></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt">
&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086;&#1073;&#1086; &#1074;&#1089;&#1077;&#1093; &#1101;&#1090;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; </span>
<span lang="EN-US" style="font-size: 14.0pt">TLINK</span><span style="font-size: 14.0pt"> 
&#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1077;&#1090; &#1091; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1077;&#1077; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072;.</span></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt">
&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; &#1040;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082; 
&#1101;&#1090;&#1086; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1072; &#1088;&#1080;&#1089; 3.1.</span></p>
<p class="Normal" style="text-indent: 35.45pt"><span style="font-size: 14.0pt"><!--[if gte vml 1]><v:shapetype id="_x0000_t75"
 coordsize="21600,21600" o:spt="75" o:preferrelative="t" path="m@4@5l@4@11@9@11@9@5xe"
 filled="f" stroked="f">
 <v:stroke joinstyle="miter"/>
 <v:formulas>
  <v:f eqn="if lineDrawn pixelLineWidth 0"/>
  <v:f eqn="sum @0 1 0"/>
  <v:f eqn="sum 0 0 @1"/>
  <v:f eqn="prod @2 1 2"/>
  <v:f eqn="prod @3 21600 pixelWidth"/>
  <v:f eqn="prod @3 21600 pixelHeight"/>
  <v:f eqn="sum @0 0 1"/>
  <v:f eqn="prod @6 1 2"/>
  <v:f eqn="prod @7 21600 pixelWidth"/>
  <v:f eqn="sum @8 21600 0"/>
  <v:f eqn="prod @7 21600 pixelHeight"/>
  <v:f eqn="sum @10 21600 0"/>
 </v:formulas>
 <v:path o:extrusionok="f" gradientshapeok="t" o:connecttype="rect"/>
 <o:lock v:ext="edit" aspectratio="t"/>
</v:shapetype><v:shape id="_x0000_s1046" type="#_x0000_t75" style='width:294.75pt;
 height:259.5pt' fillcolor="window">
 <v:imagedata src="3.files/image001.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=393 height=346
src="3.files/image002.gif" v:shapes="_x0000_s1046"><![endif]><!--[if gte mso 9]><![endif]--></span></p>

</body>

</html>
