<html xmlns:v="urn:schemas-microsoft-com:vml" xmlns:o="urn:schemas-microsoft-com:office:office" xmlns="http://www.w3.org/TR/REC-html40">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<link rel="File-List" href="5.files/filelist.xml">
<title>&#1051;&#1077;&#1082;&#1094;&#1080;&#1103 5</title>
<style>
<!--
p.MsoPlainText
	{margin-bottom:.0001pt;
	text-align:justify;
	text-indent:35.45pt;
	font-size:14.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
p.a0
	{margin-bottom:.0001pt;
	font-size:12.0pt;
	font-family:"Courier New";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
-->
</style>
<!--[if !mso]>
<style>
v\:*         { behavior: url(#default#VML) }
o\:*         { behavior: url(#default#VML) }
.shape       { behavior: url(#default#VML) }
</style>
<![endif]--><!--[if gte mso 9]>
<xml><o:shapedefaults v:ext="edit" spidmax="1027"/>
</xml><![endif]-->
</head>

<body>

<p class="MsoPlainText"><b>5. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1082;&#1080;</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText"><b>5.1. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">MOV</span></b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">MOV</span> – &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; 
&#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090; &#1086;&#1076;&#1080;&#1085; &#1073;&#1072;&#1081;&#1090; &#1080;&#1083;&#1080; &#1089;&#1083;&#1086;&#1074;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1074; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;, &#1080;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1080;&#1083;&#1080; &#1080;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;
<span lang="EN-US">MOV </span>&#1084;&#1086;&#1078;&#1077;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1079;&#1072;&#1085;&#1077;&#1089;&#1090;&#1080; &#1095;&#1080;&#1089;&#1083;&#1086; (&#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; 
&#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;) &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1080;&#1083;&#1080; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;. &#1042; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">MOV
</span>&#1101;&#1090;&#1086; &#1094;&#1077;&#1083;&#1086;&#1077; &#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;. &#1053;&#1072; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1084; &#1085;&#1080;&#1078;&#1077; 
&#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1074; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; 
&#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1089;&#1090;&#1072; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1079;&#1076;&#1077;&#1089;&#1100; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1080;&#1083;&#1080; &#1103;&#1095;&#1077;&#1081;&#1082;&#1091; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;. &#1057;&#1090;&#1088;&#1077;&#1083;&#1082;&#1080; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1087;&#1091;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
&#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;. &#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; 
&#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;.</p>
<p class="MsoPlainText">&#1048;&#1079; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1072; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1077;&#1085;&#1099; &#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1082;&#1080; &#1080;&#1079; &#1086;&#1076;&#1085;&#1086;&#1081; 
&#1103;&#1095;&#1077;&#1081;&#1082;&#1080; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102;, &#1080;&#1079; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;, &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; 
&#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;. &#1069;&#1090;&#1086; &#1086;&#1073;&#1091;&#1089;&#1083;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1074; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; 
&#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1086; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1091; 
&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080; &#1086;&#1076;&#1085;&#1086; &#1080;&#1079; &#1090;&#1072;&#1082;&#1080;&#1093; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;, &#1090;&#1086; &#1086;&#1085;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1076;&#1074;&#1077; 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; &#1095;&#1077;&#1088;&#1077;&#1079; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1085;&#1077;&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; <span lang="EN-US">MOV </span>&#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1086;&#1075;&#1086; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; <span lang="EN-US">CS</span>. &#1069;&#1090;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1086; &#1089; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;&#1072;&#1103; &#1087;&#1072;&#1088;&#1072;
<span lang="EN-US">CS</span>:<span lang="EN-US">IP</span> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089; 
&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1077;&#1089;&#1090;&#1100; 
&#1085;&#1080;&#1095;&#1090;&#1086; &#1080;&#1085;&#1086;&#1077;, &#1082;&#1072;&#1082; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1078;&#1077; <span lang="EN-US">MOV</span> &#1085;&#1077; 
&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;.</p>
<p class="MsoPlainText"><!--[if gte vml 1]><v:shapetype id="_x0000_t75"
 coordsize="21600,21600" o:spt="75" o:preferrelative="t" path="m@4@5l@4@11@9@11@9@5xe"
 filled="f" stroked="f">
 <v:stroke joinstyle="miter"/>
 <v:formulas>
  <v:f eqn="if lineDrawn pixelLineWidth 0"/>
  <v:f eqn="sum @0 1 0"/>
  <v:f eqn="sum 0 0 @1"/>
  <v:f eqn="prod @2 1 2"/>
  <v:f eqn="prod @3 21600 pixelWidth"/>
  <v:f eqn="prod @3 21600 pixelHeight"/>
  <v:f eqn="sum @0 0 1"/>
  <v:f eqn="prod @6 1 2"/>
  <v:f eqn="prod @7 21600 pixelWidth"/>
  <v:f eqn="sum @8 21600 0"/>
  <v:f eqn="prod @7 21600 pixelHeight"/>
  <v:f eqn="sum @10 21600 0"/>
 </v:formulas>
 <v:path o:extrusionok="f" gradientshapeok="t" o:connecttype="rect"/>
 <o:lock v:ext="edit" aspectratio="t"/>
</v:shapetype><v:shape id="_x0000_s1047" type="#_x0000_t75" style='width:282pt;
 height:231pt' fillcolor="window">
 <v:imagedata src="5.files/image001.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=376 height=308
src="5.files/image002.gif" v:shapes="_x0000_s1047"><![endif]><!--[if gte mso 9]><![endif]--></p>
<p class="MsoPlainText">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1082;&#1080;:</p>
<p class="a0"><span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">Data</span>,<span lang="EN-US">DI</span></p>
<p class="a0"><span lang="EN-US">MOV&nbsp; BX,CX</span></p>
<p class="a0"><span lang="EN-US">MOV&nbsp; DI,Index</span></p>
<p class="a0"><span lang="EN-US">MOV&nbsp; Start_Seg,DS</span></p>
<p class="a0"><span lang="EN-US">MOV&nbsp; ES,Buffer</span></p>
<p class="a0"><span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">Days</span>,356</p>
<p class="a0"><span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">DI</span>,0</p>
<p class="MsoPlainText"><b><span style="color: lime">&nbsp;</span></b></p>
<p class="MsoPlainText"><b>5.2. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; <span lang="EN-US">XCHG</span></b></p>
<p class="MsoPlainText"><b>&nbsp;</b></p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">XCHG </span>&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1084;&#1077;&#1089;&#1090;&#1072;&#1084;&#1080; 
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1076;&#1074;&#1091;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074;. &#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1042; 
&#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1099;&#1089;&#1090;&#1091;&#1087;&#1072;&#1090;&#1100; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; (&#1082;&#1088;&#1086;&#1084;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093;) &#1080; &#1103;&#1095;&#1077;&#1081;&#1082;&#1080; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;.</p>
<p class="MsoPlainText">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <span lang="EN-US">XCHG</span>:</p>
<p class="a0"><span lang="EN-US">XCHG</span> <span lang="EN-US">BL</span>,<span lang="EN-US">BH</span></p>
<p class="a0"><span lang="EN-US">XCHG DH,Char</span></p>
<p class="a0"><span lang="EN-US">XCHG AX,BX</span></p>
<p class="MsoPlainText"><b><span lang="EN-US" style="color: lime">&nbsp;</span></b></p>
<p class="MsoPlainText"><b>5.3. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103;
<span lang="EN-US">LDS </span>&#1080; <span lang="EN-US">LES</span></b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1069;&#1090;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1102;&#1090; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1080;&#1079; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1080; 
&#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090; &#1077;&#1075;&#1086; &#1074; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1072;&#1088;&#1091; «&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; : &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;». &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1087;&#1077;&#1088;&#1074;&#1086;&#1077; 
&#1089;&#1083;&#1086;&#1074;&#1086; &#1080;&#1079; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1084;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072;, &#1074;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">DS</span>,&nbsp; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;
<span lang="EN-US">LDS</span>, &#1080;&#1083;&#1080; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">ES </span>&#1077;&#1089;&#1083;&#1080; 
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">LES</span>.</p>
<p class="MsoPlainText">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;:</p>
<p class="a0"><span lang="EN-US">LDS</span>&nbsp; <span lang="EN-US">BX</span>,[<span lang="EN-US">BP</span>+4]</p>
<p class="a0"><span lang="EN-US">LES</span>&nbsp; <span lang="EN-US">DI</span>,<span lang="EN-US">TablePtr</span></p>
<p class="MsoPlainText" style="text-indent: 0cm">&nbsp;</p>
<p class="MsoPlainText"><b>5.4. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1087;&#1077;&#1088;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; <span lang="EN-US">XLAT</span></b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">XLAT </span>&#1079;&#1072;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; 
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; <span lang="EN-US">AL </span>&#1073;&#1072;&#1081;&#1090;&#1086;&#1084; &#1080;&#1079; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1087;&#1077;&#1088;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; 
(&#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1076;&#1083;&#1080;&#1085;&#1085;&#1072; – 256 &#1073;&#1072;&#1081;&#1090;), &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;
<span lang="EN-US">DS </span>&#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; <span lang="EN-US">BX</span>.</p>
<p class="MsoPlainText">&#1040;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <span lang="EN-US">XLAT
</span>&#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093; &#1101;&#1090;&#1072;&#1087;&#1086;&#1074;:</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; <span lang="EN-US">AL </span>&#1087;&#1088;&#1080;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082; 
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1084;&#1091; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; <span lang="EN-US">BX</span>;</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; <span lang="EN-US">DS</span>. &#1055;&#1086; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1073;&#1072;&#1081;&#1090; &#1080; 
&#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">AL</span>.</p>
<p class="MsoPlainText"><span lang="EN-US">XLAT </span>&#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1074; 
&#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; <span lang="EN-US">BX</span>, 
&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1077;&#1088;&#1077;&#1076; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074; <span lang="EN-US">BX
</span>&#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;.</p>
<p class="MsoPlainText">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <span lang="EN-US">XLAT</span>:</p>
<p class="a0"><span lang="EN-US">MOV</span>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">BX</span>,<span lang="EN-US">OFFSET 
Talbe</span></p>
<p class="a0"><span lang="EN-US">MOV&nbsp; &nbsp;&nbsp;&nbsp;&nbsp; AL,2</span></p>
<p class="a0"><span lang="EN-US">XLAT </span></p>
<p class="a0"><span lang="EN-US">...</span></p>
<p class="a0"><span lang="EN-US">Table&nbsp;&nbsp;&nbsp; DB&nbsp;&nbsp; ‘abcde’</span></p>
<p class="a0"><span lang="EN-US">&nbsp;</span></p>
<p class="a0"><span lang="EN-US">&nbsp;</span></p>
<p class="a0"><span lang="EN-US" style="color: lime">&nbsp;</span></p>
<p class="MsoPlainText"><b>5.5. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1086; &#1089;&#1090;&#1077;&#1082;&#1086;&#1084;</b></p>
<p class="MsoPlainText"><span style="font-size: 13.0pt">&nbsp;</span></p>
<p class="MsoPlainText">&#1050;&#1072;&#1082; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1088;&#1072;&#1085;&#1077;&#1077;, &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091;&#1077;&#1090; &#1089;&#1090;&#1077;&#1082; &#1089; 
&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;&#1086;&#1081; &#1087;&#1072;&#1088;&#1099; <span lang="EN-US">SS</span>:<span lang="EN-US">SP</span>. 
&#1055;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; &#1089;&#1090;&#1077;&#1082; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;&#1091; &#1076;&#1077;&#1082;&#1088;&#1077;&#1084;&#1077;&#1085;&#1090;&#1091; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089;&#1090;&#1077;&#1082;&#1072;, 
&#1072; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; – &#1082; &#1080;&#1085;&#1082;&#1088;&#1077;&#1084;&#1077;&#1085;&#1090;&#1091;, &#1090;.&#1077;. &#1086;&#1085; «&#1088;&#1072;&#1089;&#1090;&#1077;&#1090;» &#1074; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1091; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1093; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;.
</p>
<p class="MsoPlainText">&#1044;&#1083;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; 16-&#1073;&#1080;&#1090;&#1086;&#1074;&#1099;&#1093; 
&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <span lang="EN-US">PUSH </span>(&#1087;&#1088;&#1086;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100;) 
&#1080; <span lang="EN-US">POP </span>(&#1074;&#1099;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100;). &#1047;&#1072; &#1082;&#1086;&#1076;&#1072;&#1084;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;
<span lang="EN-US">PUSH </span>&#1080; <span lang="EN-US">POP </span>&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; (&#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100;) &#1074; (&#1080;&#1079;) &#1089;&#1090;&#1077;&#1082;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; 
&#1074;&#1099;&#1089;&#1090;&#1091;&#1087;&#1072;&#1090;&#1100; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1080;&#1083;&#1080; &#1103;&#1095;&#1077;&#1081;&#1082;&#1072; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; 
&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080;.</p>
<p class="MsoPlainText">&#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;: &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">POP CS</span> 
&#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1072; (&#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">CS </span>
&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; <span lang="EN-US">RET</span>).</p>
<p class="MsoPlainText">&#1044;&#1083;&#1103; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1090;&#1077;&#1082; &#1080; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; 
&#1092;&#1083;&#1072;&#1075;&#1086;&#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <span lang="EN-US">PUSHF </span>&#1080;
<span lang="EN-US">POPF </span>&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;.</p>
<p class="MsoPlainText">&#1057;&#1090;&#1077;&#1082; &#1091;&#1076;&#1086;&#1073;&#1077;&#1085; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1074; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1080;&#1079; 
&#1085;&#1080;&#1093;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <span lang="EN-US">BP </span>&#1082;&#1072;&#1082; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1072; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1089;&#1090;&#1077;&#1082;&#1072;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1081; 
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; <span lang="EN-US">BP </span>&#1076;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; 
&#1095;&#1077;&#1088;&#1077;&#1079; &#1089;&#1090;&#1077;&#1082;.</p>
<p class="a0"><span lang="EN-US">CODE</span> <span lang="EN-US">SEGMENT</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; ...</p>
<p class="a0"><span lang="EN-US">PROC</span>1&nbsp;&nbsp;&nbsp; <span lang="EN-US">PROC</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">BP</span>,<span lang="EN-US">SP</span> 
&nbsp;&nbsp; ;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1074; <span lang="EN-US">BP</span> &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1089;&#1090;&#1077;&#1082;&#1072;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">BX</span>,[<span lang="EN-US">BP</span>+4];&#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1072; 
&#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; 1 &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; (<span lang="EN-US">ca</span>) </p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; ...</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">BX</span>,[<span lang="EN-US">BP</span>+2];&#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1072; 
&#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; 2 &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; (<span lang="EN-US">ll</span>)</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; ...</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">RET</span>&nbsp; 4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ;&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1089; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; 
4 &#1089;&#1083;&#1086;&#1074; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072;</p>
<p class="a0"><span lang="EN-US">PROC</span>1&nbsp;&nbsp;&nbsp; <span lang="EN-US">ENDP</span></p>
<p class="a0"><span lang="EN-US">START</span>:</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; ...</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">AX</span>,’<span lang="EN-US">ca</span>’&nbsp; 
;&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1074; <span lang="EN-US">AX</span> &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">CX</span>,’<span lang="EN-US">ll</span>’&nbsp; 
;&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1074; <span lang="EN-US">CX</span> &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">PUSH</span> <span lang="EN-US">AX</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
;&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; <span lang="EN-US">AX</span> &#1074; &#1089;&#1090;&#1077;&#1082;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">PUSH</span> <span lang="EN-US">CX</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
;&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; <span lang="EN-US">CX</span> &#1074; &#1089;&#1090;&#1077;&#1082;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">CALL</span> <span lang="EN-US">PROC</span>1&nbsp;&nbsp;&nbsp;
</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; ...</p>
<p class="a0"><span lang="EN-US">CODE</span> <span lang="EN-US">ENDS</span> </p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText"><b>5.6. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1074;&#1086;&#1076;&#1072;-&#1074;&#1099;&#1074;&#1086;&#1076;&#1072;</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1042;&#1089;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1069;&#1042;&#1052; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086; &#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; 
(&#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1062;&#1055;, &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1072;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1054;&#1055;) &#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; (&#1074;&#1085;&#1077;&#1096;&#1085;&#1103;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;, 
&#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1072;, &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081; &#1080; &#1090;. &#1076;.). &#1055;&#1086;&#1076; &#1074;&#1074;&#1086;&#1076;&#1086;&#1084;-&#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1084; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1084;&#1077;&#1085; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; 
&#1084;&#1077;&#1078;&#1076;&#1091; &#1062;&#1055; &#1080; &#1083;&#1102;&#1073;&#1099;&#1084; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084;. &#1042; &#1069;&#1042;&#1052; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1062;&#1055; &#1080; 
&#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1086;&#1088;&#1090;&#1099;. &#1055;&#1086;&#1088;&#1090; – &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; 
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; &#1074; &#1073;&#1072;&#1081;&#1090;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081;&#1089;&#1103; &#1074;&#1085;&#1077; &#1062;&#1055; (&#1076;&#1074;&#1072; &#1089;&#1086;&#1089;&#1077;&#1076;&#1085;&#1080;&#1093; &#1087;&#1086;&#1088;&#1090;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; 
&#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1087;&#1086;&#1088;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; &#1074; &#1089;&#1083;&#1086;&#1074;&#1086;). &#1054;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082; &#1087;&#1086;&#1088;&#1090;&#1072;&#1084; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1086; 
&#1085;&#1086;&#1084;&#1077;&#1088;&#1072;&#1084;. &#1042;&#1089;&#1077; &#1087;&#1086;&#1088;&#1090;&#1099; &#1085;&#1091;&#1084;&#1077;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090; 0 &#1076;&#1086; 0<span lang="EN-US">FFFFh</span>. &#1057; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084; 
&#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085; &#1089;&#1074;&#1086;&#1081; &#1087;&#1086;&#1088;&#1090; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1088;&#1090;&#1086;&#1074;, &#1080;&#1093; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1079;&#1072;&#1088;&#1072;&#1085;&#1077;&#1077; 
&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;. </p>
<p class="MsoPlainText">&#1047;&#1072;&#1087;&#1080;&#1089;&#1100; &#1080; &#1095;&#1090;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1088;&#1090;&#1072; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; 
&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;:</p>
<p class="a0">&#1063;&#1090;&#1077;&#1085;&#1080;&#1077; (&#1074;&#1074;&#1086;&#1076;):&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">IN</span>&nbsp;&nbsp;
<span lang="EN-US">AL</span>, <span lang="EN-US">n</span>&nbsp;&nbsp;&nbsp; &#1080;&#1083;&#1080;&nbsp;
<span lang="EN-US">IN</span>&nbsp;&nbsp; <span lang="EN-US">AX</span>, <span lang="EN-US">
n</span></p>
<p class="a0">&#1047;&#1072;&#1087;&#1080;&#1089;&#1100; (&#1074;&#1099;&#1074;&#1086;&#1076;):<span lang="EN-US">OUT</span> <span lang="EN-US">n</span>,
<span lang="EN-US">AL</span>&nbsp;&nbsp;&nbsp; &#1080;&#1083;&#1080;&nbsp; <span lang="EN-US">OUT</span>&nbsp;
<span lang="EN-US">n</span>, <span lang="EN-US">AX</span></p>
<p class="MsoPlainText">&#1053;&#1086;&#1084;&#1077;&#1088; &#1087;&#1086;&#1088;&#1090;&#1072; <span lang="EN-US">n </span>&#1074; &#1101;&#1090;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1093; 
&#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085; &#1083;&#1080;&#1073;&#1086; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1083;&#1080;&#1073;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1084; <span lang="EN-US">DX</span>.</p>
<p class="MsoPlainText">
<span style="font-size: 12.0pt; font-family: Courier New">&nbsp;</span><span lang="EN-US" style="font-size: 12.0pt; font-family: Courier New">IN</span><span style="font-size: 12.0pt; font-family: Courier New">&nbsp;
</span><span lang="EN-US" style="font-size: 12.0pt; font-family: Courier New">AX</span><span style="font-size: 12.0pt; font-family: Courier New">,</span><span lang="EN-US" style="font-size: 12.0pt; font-family: Courier New">DX</span></p>
<p class="MsoPlainText">&#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081; &#1074;&#1074;&#1086;&#1076;&#1072; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1086;&#1088;&#1090;&#1099; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; 
&#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1082;&#1080; &#1090;&#1086;&#1075;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1074;&#1077;&#1076;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1084;&#1077;&#1085;, &#1085;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1062;&#1055; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085; 
&#1089; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084; &#1095;&#1077;&#1088;&#1077;&#1079; &#1076;&#1074;&#1072; &#1087;&#1086;&#1088;&#1090;&#1072;: &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; – &#1087;&#1086;&#1088;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; – &#1087;&#1086;&#1088;&#1090; 
&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1080;&#1087;&#1080;&#1095;&#1085;&#1086;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072;:</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1062;&#1055; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074; &#1087;&#1086;&#1088;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;, &#1072; &#1087;&#1086;&#1088;&#1090; 
&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; – &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;;</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;, &#1089;&#1095;&#1080;&#1090;&#1072;&#1074; &#1101;&#1090;&#1091; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074; &#1087;&#1086;&#1088;&#1090; 
&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; «&#1079;&#1072;&#1085;&#1103;&#1090;&#1086;» &#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;);</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1062;&#1055; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090; &#1083;&#1080;&#1073;&#1086; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103;, &#1086;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1103; &#1074; &#1094;&#1080;&#1082;&#1083;&#1077; &#1087;&#1086;&#1088;&#1090; 
&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1083;&#1080;&#1073;&#1086; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1081; – &#1076;&#1086; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088; &#1087;&#1086;&#1082;&#1072; &#1074; &#1087;&#1086;&#1088;&#1090;&#1077; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; 
&#1085;&#1077; &#1089;&#1084;&#1077;&#1085;&#1080;&#1090;&#1089;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; «&#1079;&#1072;&#1085;&#1103;&#1090;&#1086;»;</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1077; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1079;&#1072;&#1082;&#1072;&#1085;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076; &#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074; &#1087;&#1086;&#1088;&#1090;<span style="color: lime">
</span>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1086;&#1073; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1084; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;;</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1062;&#1055; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1080; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;.</p>

</body>

</html>
