<html xmlns:v="urn:schemas-microsoft-com:vml" xmlns:o="urn:schemas-microsoft-com:office:office" xmlns="http://www.w3.org/TR/REC-html40">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<link rel="File-List" href="7.files/filelist.xml">
<title>&#1051;&#1077;&#1082;&#1094;&#1080;&#1103 7</title>
<style>
<!--
p.MsoPlainText
	{margin-bottom:.0001pt;
	text-align:justify;
	text-indent:35.45pt;
	font-size:14.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
p.a0
	{margin-bottom:.0001pt;
	font-size:12.0pt;
	font-family:"Courier New";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
 table.MsoNormalTable
	{mso-style-parent:"";
	font-size:10.0pt;
	font-family:"Times New Roman","serif"}
-->
</style>
<!--[if !mso]>
<style>
v\:*         { behavior: url(#default#VML) }
o\:*         { behavior: url(#default#VML) }
.shape       { behavior: url(#default#VML) }
</style>
<![endif]--><!--[if gte mso 9]>
<xml><o:shapedefaults v:ext="edit" spidmax="1027"/>
</xml><![endif]-->
</head>

<body>

<p class="MsoPlainText"><b>7. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1087;&#1086;&#1073;&#1080;&#1090;&#1086;&#1074;&#1086;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1069;&#1090;&#1091; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1076;&#1074;&#1077; &#1087;&#1086;&#1076;&#1075;&#1088;&#1091;&#1087;&#1087;&#1099;: 
&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1076;&#1074;&#1080;&#1075;&#1086;&#1074;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <span lang="EN-US">AND</span>,
<span lang="EN-US">TEST</span>, <span lang="EN-US">OR</span>, <span lang="EN-US">
XOR</span> &#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1089;&#1076;&#1074;&#1080;&#1075;&#1086;&#1074; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; <span lang="EN-US">CF</span>,
<span lang="EN-US">OF</span>, <span lang="EN-US">PF</span>, <span lang="EN-US">
SF</span>, <span lang="EN-US">ZF</span> (&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1092;&#1083;&#1072;&#1075;&#1072; <span lang="EN-US">AF</span><span lang="EN-US" style="color: lime"> 
&nbsp;</span>&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;). &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1089;&#1076;&#1074;&#1080;&#1075;&#1086;&#1074; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 
&#1092;&#1083;&#1072;&#1075;&#1080; <span lang="EN-US">OF </span>&#1080; <span lang="EN-US">CF</span>.</p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText"><b>7.1. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1097;&#1080;&#1077; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1050; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1084;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1097;&#1080;&#1084; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103;
<span lang="EN-US">AND</span>, <span lang="EN-US">OR </span>&#1080; <span lang="EN-US">
XOR</span>. &#1059;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; «&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; 
&#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;» (&#1082;&#1086;&#1085;&#1098;&#1102;&#1085;&#1082;&#1094;&#1080;&#1102;), «&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;» (&#1076;&#1080;&#1079;&#1098;&#1102;&#1085;&#1082;&#1094;&#1080;&#1102;) &#1080; «&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1097;&#1077;&#1077; &#1080;&#1083;&#1080;» 
&#1076;&#1083;&#1103; &#1076;&#1074;&#1091;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074; &#1080; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1085;&#1072; &#1084;&#1077;&#1089;&#1090;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072;. &#1050; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; 
&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">TEST</span>, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1090;&#1077; &#1078;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1095;&#1090;&#1086; &#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <span lang="EN-US">AND</span>, 
&#1085;&#1086; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1089;&#1074;&#1086;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074;, &#1072; &#1083;&#1080;&#1096;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;<span style="color: lime">
</span>&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1092;&#1083;&#1072;&#1075;&#1080;.</p>
<p class="MsoPlainText">&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1086;&#1074; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1099;&#1089;&#1090;&#1091;&#1087;&#1072;&#1090;&#1100; 
&#1090;&#1077; &#1078;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1099;, &#1095;&#1090;&#1086; &#1080; &#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1085;&#1080;&#1103;. </p>
<p class="MsoPlainText">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;:</p>
<p class="a0"><span lang="EN-US">AND</span>&nbsp; <span lang="EN-US">BL</span>,100</p>
<p class="a0"><span lang="EN-US">TEST CX,DX</span></p>
<p class="a0"><span lang="EN-US">OR&nbsp;&nbsp; DX,Mask</span></p>
<p class="a0"><span lang="EN-US">XOR</span>&nbsp; <span lang="EN-US">Flag</span>,1000<span lang="EN-US">b</span></p>
<p class="MsoPlainText"><b>&nbsp;</b></p>
<p class="MsoPlainText"><b>7.2. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1097;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1076;&#1074;&#1080;&#1075;&#1086;&#1074;</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1073;&#1080;&#1090;&#1099; &#1074; &#1087;&#1086;&#1083;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1083;&#1080;&#1073;&#1086; 
&#1074;&#1087;&#1088;&#1072;&#1074;&#1086;, &#1083;&#1080;&#1073;&#1086; &#1074;&#1083;&#1077;&#1074;&#1086;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1103; &#1083;&#1080;&#1073;&#1086; &#1089; &#1073;&#1072;&#1081;&#1090;&#1072;&#1084;&#1080;, &#1083;&#1080;&#1073;&#1086; &#1089;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;&#1080;. &#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; 
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1076;&#1074;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072;: &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076; – &#1087;&#1086;&#1083;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; – &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1083;&#1080;&#1073;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1084;, 
&#1083;&#1080;&#1073;&#1086; &#1103;&#1095;&#1077;&#1081;&#1082;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076; – &#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082; &#1089;&#1076;&#1074;&#1080;&#1075;&#1086;&#1074;. &#1045;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; 
&#1088;&#1072;&#1074;&#1085;&#1099;&#1084; 1, &#1080;&#1083;&#1080; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084;. &#1042; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1101;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; 
&#1079;&#1072;&#1085;&#1077;&#1089;&#1090;&#1080; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">CL</span>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077; 
&#1089;&#1076;&#1074;&#1080;&#1075;&#1072;. &#1063;&#1080;&#1089;&#1083;&#1086; &#1074; <span lang="EN-US">CL </span>&#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; 0-255, &#1085;&#1086; &#1077;&#1075;&#1086; 
&#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1089;&#1084;&#1099;&#1089;&#1083; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1083;&#1077;&#1078;&#1072;&#1090; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; 0-16.</p>
<p class="MsoPlainText">&#1054;&#1073;&#1097;&#1072;&#1103; &#1095;&#1077;&#1088;&#1090;&#1072; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; – &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1092;&#1083;&#1072;&#1075;&#1072; 
&#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072;. &#1041;&#1080;&#1090;, &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1081; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1092;&#1083;&#1072;&#1075;&#1077; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072;. 
&#1042;&#1089;&#1077;&#1075;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; 8 &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072;: 4 &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1080; 4 &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;<span style="color: lime">
</span>&#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1103;&#1090; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1074; 
&#1082;&#1086;&#1085;&#1094;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072; &#1073;&#1080;&#1090; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1082;&#1086;&#1085;&#1077;&#1094;, &#1072; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1101;&#1090;&#1086;&#1090; &#1073;&#1080;&#1090; 
&#1087;&#1088;&#1086;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1084;&#1086;&#1077; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;, &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1090;&#1080;&#1087;&#1072; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072;. &#1055;&#1088;&#1080; 
&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1089;&#1076;&#1074;&#1080;&#1075;&#1077; &#1074;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1084;&#1099;&#1081; &#1073;&#1080;&#1090; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; 0, &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1089;&#1076;&#1074;&#1080;&#1075; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090; 
&#1074;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1084;&#1099;&#1081; &#1073;&#1080;&#1090; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1082; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;&#1072;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; 
&#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1089; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1086;&#1084; &#1080; &#1073;&#1077;&#1079; &#1085;&#1077;&#1075;&#1086; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1088;&#1072;&#1082;&#1090;&#1086;&#1074;&#1082;&#1086;&#1081; &#1092;&#1083;&#1072;&#1075;&#1072; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072;. 
&#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1090; &#1077;&#1075;&#1086; &#1082;&#1072;&#1082; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; 9-&#1099;&#1081; &#1080;&#1083;&#1080; 17-&#1099;&#1081; &#1073;&#1080;&#1090; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; 
&#1089;&#1076;&#1074;&#1080;&#1075;&#1072;, &#1072; &#1074;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077;&#1090;.</p>
<p class="MsoPlainText">&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1087;&#1077;&#1088;&#1077;&#1095;&#1077;&#1085;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072;:</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; <span lang="EN-US">SHR </span>&#1080; 
&#1074;&#1083;&#1077;&#1074;&#1086; <span lang="EN-US">SHL</span>;</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; <span lang="EN-US">SAR
</span>&#1080; &#1074;&#1083;&#1077;&#1074;&#1086; <span lang="EN-US">SAL</span>;</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; <span lang="EN-US">ROR </span>&#1080; 
&#1074;&#1083;&#1077;&#1074;&#1086; <span lang="EN-US">ROL</span>;</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; <span lang="EN-US">RCR </span>&#1080; 
&#1074;&#1083;&#1077;&#1074;&#1086; <span lang="EN-US">RCL </span>&#1089; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1086;&#1084;;</p>
<p class="MsoPlainText">&#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1080;.</p>
<table class="MsoNormalTable" border="0" cellspacing="0" cellpadding="0" style="border-collapse: collapse">
	<tr>
		<td width="310" valign="top" style="width: 232.15pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shapetype id="_x0000_t75"
 coordsize="21600,21600" o:spt="75" o:preferrelative="t" path="m@4@5l@4@11@9@11@9@5xe"
 filled="f" stroked="f">
 <v:stroke joinstyle="miter"/>
 <v:formulas>
  <v:f eqn="if lineDrawn pixelLineWidth 0"/>
  <v:f eqn="sum @0 1 0"/>
  <v:f eqn="sum 0 0 @1"/>
  <v:f eqn="prod @2 1 2"/>
  <v:f eqn="prod @3 21600 pixelWidth"/>
  <v:f eqn="prod @3 21600 pixelHeight"/>
  <v:f eqn="sum @0 0 1"/>
  <v:f eqn="prod @6 1 2"/>
  <v:f eqn="prod @7 21600 pixelWidth"/>
  <v:f eqn="sum @8 21600 0"/>
  <v:f eqn="prod @7 21600 pixelHeight"/>
  <v:f eqn="sum @10 21600 0"/>
 </v:formulas>
 <v:path o:extrusionok="f" gradientshapeok="t" o:connecttype="rect"/>
 <o:lock v:ext="edit" aspectratio="t"/>
</v:shapetype><v:shape id="_x0000_s1055" type="#_x0000_t75" style='width:168pt;
 height:54pt' fillcolor="window">
 <v:imagedata src="7.files/image001.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=224 height=72
src="7.files/image002.gif" v:shapes="_x0000_s1055"><![endif]><!--[if gte mso 9]><![endif]--></td>
		<td width="310" valign="top" style="width: 232.15pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shape
 id="_x0000_s1056" type="#_x0000_t75" style='width:168pt;height:57.75pt'
 fillcolor="window">
 <v:imagedata src="7.files/image003.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=224 height=77
src="7.files/image004.gif" v:shapes="_x0000_s1056"><![endif]><!--[if gte mso 9]><![endif]--></td>
	</tr>
	<tr>
		<td width="310" valign="top" style="width: 232.15pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shape
 id="_x0000_s1057" type="#_x0000_t75" style='width:168pt;height:54pt'
 fillcolor="window">
 <v:imagedata src="7.files/image005.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=224 height=72
src="7.files/image006.gif" v:shapes="_x0000_s1057"><![endif]><!--[if gte mso 9]><![endif]--></td>
		<td width="310" valign="top" style="width: 232.15pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shape
 id="_x0000_s1058" type="#_x0000_t75" style='width:168pt;height:57.75pt'
 fillcolor="window">
 <v:imagedata src="7.files/image007.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=224 height=77
src="7.files/image008.gif" v:shapes="_x0000_s1058"><![endif]><!--[if gte mso 9]><![endif]--></td>
	</tr>
	<tr>
		<td width="310" valign="top" style="width: 232.15pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shape
 id="_x0000_s1059" type="#_x0000_t75" style='width:168pt;height:54pt'
 fillcolor="window">
 <v:imagedata src="7.files/image009.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=224 height=72
src="7.files/image010.gif" v:shapes="_x0000_s1059"><![endif]><!--[if gte mso 9]><![endif]--></td>
		<td width="310" valign="top" style="width: 232.15pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shape
 id="_x0000_s1060" type="#_x0000_t75" style='width:168pt;height:57.75pt'
 fillcolor="window">
 <v:imagedata src="7.files/image011.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=224 height=77
src="7.files/image012.gif" v:shapes="_x0000_s1060"><![endif]><!--[if gte mso 9]><![endif]--></td>
	</tr>
	<tr>
		<td width="310" valign="top" style="width: 232.15pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shape
 id="_x0000_s1061" type="#_x0000_t75" style='width:168pt;height:54pt'
 fillcolor="window">
 <v:imagedata src="7.files/image013.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=224 height=72
src="7.files/image014.gif" v:shapes="_x0000_s1061"><![endif]><!--[if gte mso 9]><![endif]--></td>
		<td width="310" valign="top" style="width: 232.15pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shape
 id="_x0000_s1062" type="#_x0000_t75" style='width:168pt;height:57.75pt'
 fillcolor="window">
 <v:imagedata src="7.files/image015.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=224 height=77
src="7.files/image016.gif" v:shapes="_x0000_s1062"><![endif]><!--[if gte mso 9]><![endif]--></td>
	</tr>
</table>
<p class="MsoPlainText"><span style="font-size: 12.0pt">&#1056;&#1080;&#1089;. 7.1. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; 
&#1089;&#1076;&#1074;&#1080;&#1075;&#1072;.</span></p>
<p class="MsoPlainText">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072;:</p>
<p class="a0"><span lang="EN-US">SHL&nbsp; CH,1</span></p>
<p class="a0"><span lang="EN-US">SHL&nbsp; [BP],CL</span></p>
<p class="a0"><span lang="EN-US">RCL&nbsp; Size,1</span></p>
<p class="MsoPlainText">&#1055;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1072;&#1103; &#1085;&#1080;&#1078;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1087;&#1086;&#1073;&#1080;&#1090;&#1086;&#1074;&#1086;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;.</p>
<p class="MsoPlainText">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;. &#1042;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; 
&#1082;&#1086;&#1076;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; «<span lang="EN-US">Q</span>».</p>
<p class="a0"><span lang="EN-US">;&#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1089;&#1090;&#1077;&#1082;&#1072;</span></p>
<p class="a0"><span lang="EN-US">SSEG&nbsp;&nbsp;&nbsp;&nbsp; SEGMENT&nbsp; STACK</span></p>
<p class="a0"><span lang="EN-US">&nbsp;&nbsp;&nbsp;&nbsp; DB&nbsp;&nbsp; 256 DUP (?)</span></p>
<p class="a0"><span lang="EN-US">SSEG&nbsp;&nbsp;&nbsp;&nbsp; ENDS</span></p>
<p class="a0"><span lang="EN-US">;&#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</span></p>
<p class="a0"><span lang="EN-US">DSEG&nbsp;&nbsp;&nbsp;&nbsp; SEGMENT</span></p>
<p class="a0"><span lang="EN-US">SMP&nbsp; DB&nbsp;&nbsp; ‘Q’&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ;&#1057;&#1080;&#1084;&#1074;&#1086;&#1083;</span></p>
<p class="a0"><span lang="EN-US">TBL&nbsp; DB&nbsp;&nbsp; ‘0123456789ABCDEF’ ;&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; 16-&#1088;&#1080;&#1095;&#1085;&#1099;&#1093; 
&#1094;&#1080;&#1092;&#1088;</span></p>
<p class="a0"><span lang="EN-US">DSEG&nbsp;&nbsp;&nbsp;&nbsp; ENDS</span></p>
<p class="a0"><span lang="EN-US">;&#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086;&#1076;&#1072;</span></p>
<p class="a0"><span lang="EN-US">CSEG&nbsp;&nbsp;&nbsp;&nbsp; SEGMENT</span></p>
<p class="a0"><span lang="EN-US">ASSUME&nbsp;&nbsp; CS:CSEG, DS:DSEG, SS:SSEG</span></p>
<p class="a0"><span lang="EN-US">START:</span></p>
<p class="a0"><span lang="EN-US">&nbsp;&nbsp;&nbsp;&nbsp; MOV&nbsp; AX,DSEG&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ;&#1048;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; DS</span></p>
<p class="a0"><span lang="EN-US">&nbsp;&nbsp;&nbsp;&nbsp; MOV</span>&nbsp; <span lang="EN-US">DS</span>,<span lang="EN-US">AX</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">AH</span>,2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
;&#1042; <span lang="EN-US">AH</span> &#1085;&#1086;&#1084;&#1077;&#1088; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">BX</span>,0</p>
<p class="a0">;&#1042;&#1099;&#1074;&#1086;&#1076; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1094;&#1080;&#1092;&#1088;&#1099; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1083;&#1077;&#1074;&#1086;&#1081; &#1090;&#1077;&#1090;&#1088;&#1072;&#1076;&#1077;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">BL</span>,<span lang="EN-US">Smp</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
;&#1042; <span lang="EN-US">BL</span> &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">CL</span>,4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
;&#1042; <span lang="EN-US">CL</span> &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1072; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">SHR</span>&nbsp; <span lang="EN-US">BL</span>,<span lang="EN-US">CL</span>&nbsp;&nbsp;&nbsp; 
&nbsp;&nbsp;&nbsp;&nbsp; ;&#1057;&#1076;&#1074;&#1080;&#1075; &#1083;&#1077;&#1074;&#1086;&#1081; &#1090;&#1077;&#1090;&#1088;&#1072;&#1076;&#1099; &#1085;&#1072; &#1084;&#1077;&#1089;&#1090;&#1086; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">DL</span>,<span lang="EN-US">Tbl</span>[<span lang="EN-US">BX</span>]&nbsp;&nbsp;&nbsp; 
;&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1094;&#1080;&#1092;&#1088;&#1099;&nbsp; &#1080;&#1079; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1074; <span lang="EN-US">DL</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">INT</span>&nbsp; 21<span lang="EN-US">H</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
;&#1042;&#1099;&#1074;&#1086;&#1076; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;</p>
<p class="a0">;&#1042;&#1099;&#1074;&#1086;&#1076; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1094;&#1080;&#1092;&#1088;&#1099; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081;&nbsp; &#1090;&#1077;&#1090;&#1088;&#1072;&#1076;&#1077;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">BL</span>,<span lang="EN-US">Smp</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
;&#1042; <span lang="EN-US">BL</span> &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">AND</span>&nbsp; <span lang="EN-US">BL</span>,00001111<span lang="EN-US">B</span>&nbsp; 
;&#1054;&#1073;&#1085;&#1091;&#1083;&#1077;&#1085;&#1080;&#1077; &#1083;&#1077;&#1074;&#1086;&#1081; &#1090;&#1077;&#1090;&#1088;&#1072;&#1076;&#1099;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">DL</span>,<span lang="EN-US">Tbl</span>[<span lang="EN-US">BX</span>]&nbsp;&nbsp;&nbsp; 
;&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1094;&#1080;&#1092;&#1088;&#1099;&nbsp; &#1080;&#1079; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1074; <span lang="EN-US">DL</span></p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">INT</span>&nbsp; 21<span lang="EN-US">H</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
;&#1042;&#1099;&#1074;&#1086;&#1076; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;</p>
<p class="a0">;&#1042;&#1099;&#1074;&#1086;&#1076; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; «<span lang="EN-US">h</span>»</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">MOV&nbsp; DL,’h’&nbsp;&nbsp; </span></p>
<p class="a0"><span lang="EN-US">&nbsp;&nbsp;&nbsp;&nbsp; INT&nbsp; 21H</span></p>
<p class="a0"><span lang="EN-US">CSEG&nbsp;&nbsp;&nbsp;&nbsp; ENDS</span></p>
<p class="a0"><span lang="EN-US">END</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span lang="EN-US">START</span></p>
<p class="MsoPlainText">&#1055;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1099;&#1081; 
&#1082;&#1086;&#1076;&#1072; &#1073;&#1091;&#1082;&#1074;&#1099; «<span lang="EN-US">Q</span>», &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103;&nbsp; &#1076;&#1074;&#1077; 
&#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1099;&#1077; &#1094;&#1080;&#1092;&#1088;&#1099;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1090;&#1077;&#1090;&#1088;&#1072;&#1076;&#1072;&#1084; &#1073;&#1072;&#1081;&#1090;&#1072;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1076; 
&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; «<span lang="EN-US">Q</span>». &#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1090;&#1077;&#1090;&#1088;&#1072;&#1076;&#1099; &#1082;&#1072;&#1082; 
&#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093;&#1073;&#1080;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072; &#1076;&#1083;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; 
&#1073;&#1072;&#1081;&#1090;&#1086;&#1074;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1099;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;. &#1058;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1080;&#1077;&#1084; 
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1075;&#1086; &#1073;&#1080;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; 
&#1074;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1077;.</p>

</body>

</html>
