<html xmlns:v="urn:schemas-microsoft-com:vml" xmlns:o="urn:schemas-microsoft-com:office:office" xmlns="http://www.w3.org/TR/REC-html40">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<link rel="File-List" href="9.files/filelist.xml">
<title>&#1051;&#1077;&#1082;&#1094;&#1080;&#1103 9</title>
<style>
<!--
p.MsoPlainText
	{margin-bottom:.0001pt;
	text-align:justify;
	text-indent:35.45pt;
	font-size:14.0pt;
	font-family:"Times New Roman","serif";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
p.a0
	{margin-bottom:.0001pt;
	font-size:12.0pt;
	font-family:"Courier New";
	margin-left:0cm; margin-right:0cm; margin-top:0cm}
 table.MsoNormalTable
	{mso-style-parent:"";
	font-size:10.0pt;
	font-family:"Times New Roman","serif"}
-->
</style>
<!--[if !mso]>
<style>
v\:*         { behavior: url(#default#VML) }
o\:*         { behavior: url(#default#VML) }
.shape       { behavior: url(#default#VML) }
</style>
<![endif]--><!--[if gte mso 9]>
<xml><o:shapedefaults v:ext="edit" spidmax="1027"/>
</xml><![endif]-->
</head>

<body>

<p class="MsoPlainText"><b>9. &#1055;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;.</b></p>
<p class="MsoPlainText">&nbsp;</p>
<p class="MsoPlainText">&#1042;&#1089;&#1077; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; 
&#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1091; – &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;, 
&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072;&#1084;&#1080;, &#1080; &#1086;&#1076;&#1085;&#1086;&#1081; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; 
&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1101;&#1090;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1085;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1103; &#1080;&#1084; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1084;. &#1055;&#1086;&#1089;&#1083;&#1077; 
&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; 
&#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1079;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.</p>
<p class="MsoPlainText">&#1044;&#1086;&#1089;&#1090;&#1086;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086;&#1084; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; 
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1084;&#1072; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086; 
&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1095;&#1072;&#1089;&#1090;&#1103;&#1084;&#1080;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1101;&#1090;&#1080; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093;, &#1085;&#1077; &#1087;&#1088;&#1080;&#1073;&#1077;&#1075;&#1072;&#1103; &#1082; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1102; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;. &#1042; &#1076;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1077; 
&#1082;&#1086; &#1074;&#1089;&#1077;&#1084;&#1091;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1090;&#1100; 64&#1050;, &#1090;&#1086; &#1087;&#1088;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1089; &#1086;&#1073;&#1098;&#1077;&#1084;&#1086;&#1084; &#1082;&#1086;&#1076;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; 64&#1050;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077; &#1086;&#1073;&#1086;&#1081;&#1090;&#1080;&#1089;&#1100; &#1073;&#1077;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1072;.</p>
<p class="MsoPlainText">&#1071;&#1079;&#1099;&#1082; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1040;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; 
&#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088; &#1076;&#1074;&#1091;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; – &#1073;&#1083;&#1080;&#1078;&#1085;&#1077;&#1075;&#1086; (<span lang="EN-US">near</span>) &#1080; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1075;&#1086; (<span lang="EN-US">far</span>).</p>
<p class="MsoPlainText">&#1055;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1073;&#1083;&#1080;&#1078;&#1085;&#1077;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; 
&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;. &#1044;&#1072;&#1083;&#1100;&#1085;&#1080;&#1081; &#1090;&#1080;&#1087; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1082; &#1085;&#1077;&#1081; 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;.</p>
<p class="MsoPlainText">&#1055;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; 
&#1074; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1091;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;:</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1073;&#1083;&#1080;&#1078;&#1085;&#1077;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; – &#1089;&#1083;&#1086;&#1074;&#1086;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1077; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; 
&#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1076;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;;</p>
<p class="MsoPlainText" style="margin-left: 0cm">
<span style="font-family: Symbol">-<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7.0pt; font-family: Times New Roman">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
</span></span>&#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; – &#1089;&#1083;&#1086;&#1074;&#1086;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1074; 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072; &#1090;&#1086;&#1095;&#1082;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072;, &#1080; &#1089;&#1083;&#1086;&#1074;&#1086;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1077; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; 
&#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077;.</p>
<p class="MsoPlainText">&#1042; &#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1097;&#1080;&#1093; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;, 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1080;&#1082;&#1072;&#1082; &#1085;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1044;&#1083;&#1103; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1072; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1103;&#1090;&#1080;&#1103; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077; 
&#1040;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1103;&#1090;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;. &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; 
&#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;:</p>
<p class="a0">&lt;&#1080;&#1084;&#1103;_&#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099;&gt;&nbsp;&nbsp;&nbsp; <span lang="EN-US">PROC</span> &lt;&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&gt;</p>
<p class="a0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;&#1090;&#1077;&#1083;&#1086;_&#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099;&gt;</p>
<p class="a0">&lt;&#1080;&#1084;&#1103;_&#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099;&gt;&nbsp;&nbsp;&nbsp; <span lang="EN-US">ENDP</span></p>
<p class="MsoPlainText">&#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1074; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077;
<span lang="EN-US">PROC </span>&#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1084;&#1077;&#1085;&#1080; &#1085;&#1077; &#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1076;&#1074;&#1086;&#1077;&#1090;&#1086;&#1095;&#1080;&#1077;, &#1093;&#1086;&#1090;&#1103; &#1080;&#1084;&#1103; &#1080; 
&#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1082;&#1086;&#1081;.</p>
<p class="MsoPlainText">&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;
<span lang="EN-US">PROC</span>, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1090;&#1080;&#1087; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099;: &#1073;&#1083;&#1080;&#1078;&#1085;&#1080;&#1081; (<span lang="EN-US">NEAR</span>) 
&#1080;&#1083;&#1080; &#1076;&#1072;&#1083;&#1100;&#1085;&#1080;&#1081; (<span lang="EN-US">FAR</span>). &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1090;&#1086; &#1087;&#1086; 
&#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1073;&#1083;&#1080;&#1078;&#1085;&#1077;&#1081;.</p>
<p class="MsoPlainText">&#1042; &#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1074; &#1090;&#1077;&#1083;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1075;&#1076;&#1077; &#1091;&#1075;&#1086;&#1076;&#1085;&#1086;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1089;&#1072;&#1084;&#1072; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; 
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072;, &#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1080; &#1082; &#1085;&#1077;&#1081;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; 
&#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1083;&#1080;&#1073;&#1086; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082;&#1086;&#1076;&#1072;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; 
&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1083;&#1080;&#1073;&#1086; &#1074; &#1089;&#1072;&#1084;&#1086;&#1084; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082;&#1086;&#1076;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1074;&#1093;&#1086;&#1076;&#1072; &#1074; 
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;. &#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1085;&#1077;&#1088;&#1077;&#1076;&#1082;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; 
&#1082;&#1086;&#1076;&#1086;&#1074;&#1086;&#1084; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077;.</p>
<table class="MsoNormalTable" border="0" cellspacing="0" cellpadding="0" style="border-collapse: collapse">
	<tr>
		<td width="206" valign="top" style="width: 154.75pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shapetype id="_x0000_t75"
 coordsize="21600,21600" o:spt="75" o:preferrelative="t" path="m@4@5l@4@11@9@11@9@5xe"
 filled="f" stroked="f">
 <v:stroke joinstyle="miter"/>
 <v:formulas>
  <v:f eqn="if lineDrawn pixelLineWidth 0"/>
  <v:f eqn="sum @0 1 0"/>
  <v:f eqn="sum 0 0 @1"/>
  <v:f eqn="prod @2 1 2"/>
  <v:f eqn="prod @3 21600 pixelWidth"/>
  <v:f eqn="prod @3 21600 pixelHeight"/>
  <v:f eqn="sum @0 0 1"/>
  <v:f eqn="prod @6 1 2"/>
  <v:f eqn="prod @7 21600 pixelWidth"/>
  <v:f eqn="sum @8 21600 0"/>
  <v:f eqn="prod @7 21600 pixelHeight"/>
  <v:f eqn="sum @10 21600 0"/>
 </v:formulas>
 <v:path o:extrusionok="f" gradientshapeok="t" o:connecttype="rect"/>
 <o:lock v:ext="edit" aspectratio="t"/>
</v:shapetype><v:shape id="_x0000_s1063" type="#_x0000_t75" style='width:120.75pt;
 height:108pt' fillcolor="window">
 <v:imagedata src="9.files/image001.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=161 height=144
src="9.files/image002.gif" v:shapes="_x0000_s1063"><![endif]><!--[if gte mso 9]><![endif]--></td>
		<td width="206" valign="top" style="width: 154.75pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shape
 id="_x0000_s1064" type="#_x0000_t75" style='width:120.75pt;height:108pt'
 fillcolor="window">
 <v:imagedata src="9.files/image003.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=161 height=144
src="9.files/image004.gif" v:shapes="_x0000_s1064"><![endif]><!--[if gte mso 9]><![endif]--></td>
		<td width="206" valign="top" style="width: 154.75pt; padding-left: 5.4pt; padding-right: 5.4pt; padding-top: 0cm; padding-bottom: 0cm">
		<p class="MsoPlainText" align="center" style="text-align: center; text-indent: 0cm"><!--[if gte vml 1]><v:shape
 id="_x0000_s1065" type="#_x0000_t75" style='width:120.75pt;height:129.75pt'
 fillcolor="window">
 <v:imagedata src="9.files/image005.wmz" o:title=""/>
</v:shape><![endif]--><![if !vml]><img border=0 width=161 height=173
src="9.files/image006.gif" v:shapes="_x0000_s1065"><![endif]><!--[if gte mso 9]><![endif]--></td>
	</tr>
</table>
<p class="MsoPlainText"><span style="font-size: 12.0pt">&#1056;&#1080;&#1089;. 9.1. &#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; 
&#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1074; &#1090;&#1077;&#1083;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.</span></p>
<p class="MsoPlainText">&#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; 
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; – &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1095;&#1077;&#1088;&#1077;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;: 
&#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099;, &#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072; &#1087;&#1086; 
&#1084;&#1077;&#1088;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1080;&#1093; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1074; &#1089;&#1074;&#1086;&#1077;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;. 
&#1058;&#1072;&#1082;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1076;&#1080;&#1085; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1082;: &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1095;&#1077;&#1088;&#1077;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1077;&#1089;&#1083;&#1080; &#1080;&#1093; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; (&#1077;&#1089;&#1083;&#1080; &#1084;&#1085;&#1086;&#1075;&#1086;, &#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077; &#1093;&#1074;&#1072;&#1090;&#1080;&#1090; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1086;&#1074;). &#1056;&#1077;&#1096;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086; 
&#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1095;&#1077;&#1088;&#1077;&#1079; &#1089;&#1090;&#1077;&#1082;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; 
&#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074; &#1089;&#1090;&#1077;&#1082; &#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;, &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089; 
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084;&#1080; &#1080;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1086;&#1095;&#1080;&#1097;&#1072;&#1077;&#1090; &#1089;&#1090;&#1077;&#1082; (&#1089;&#1084;. &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; «5.5. 
&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1086; &#1089;&#1090;&#1077;&#1082;&#1086;&#1084;»).</p>
<p class="MsoPlainText">&#1044;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084;&#1080; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; 
&#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1101;&#1090;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; <span lang="EN-US">CALL
</span>&#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; <span lang="EN-US">RET</span>.</p>
<p class="MsoPlainText">&#1042;&#1089;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; <span lang="EN-US">CALL </span>
&#1073;&#1077;&#1079;&#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080;&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1074;&#1099;&#1079;&#1086;&#1074; <span lang="EN-US">NEAR CALL </span>
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1077;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1081;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077;. 
&#1054;&#1085; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; <span lang="EN-US">IP </span>&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090; 
&#1089;&#1090;&#1072;&#1088;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1095;&#1077;&#1090;&#1095;&#1080;&#1082;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; (<span lang="EN-US">IP</span>) &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1074; 
&#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072;. &#1052;&#1077;&#1078;&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1074;&#1099;&#1079;&#1086;&#1074; <span lang="EN-US">FAR CALL </span>
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1077;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1081;&#1089;&#1103; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1077; 
&#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;. &#1054;&#1085; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;
<span lang="EN-US">CS </span>&#1080; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; <span lang="EN-US">IP </span>&#1076;&#1083;&#1103; 
&#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1075;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090; &#1074; &#1089;&#1090;&#1077;&#1082;&#1077; &#1082;&#1072;&#1082; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;
<span lang="EN-US">IP</span>, &#1090;&#1072;&#1082; &#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">CS</span>.</p>
<p class="MsoPlainText">&#1042;&#1089;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1099; <span lang="EN-US">RET </span>&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; 
&#1082;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072;&#1084;&#1080;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1102;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1080;&#1079; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; &#1089;&#1090;&#1077;&#1082;&#1072;. 
&#1042;&#1085;&#1091;&#1090;&#1088;&#1080;&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; &#1086;&#1076;&#1085;&#1086; &#1089;&#1083;&#1086;&#1074;&#1086; &#1080; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1077;&#1075;&#1086; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;
<span lang="EN-US">IP</span>, &#1072; &#1084;&#1077;&#1078;&#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1080;&#1079; &#1089;&#1090;&#1077;&#1082;&#1072; &#1076;&#1074;&#1072; 
&#1089;&#1083;&#1086;&#1074;&#1072;, &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072; &#1080;&#1079; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">IP</span>, 
&#1072; &#1089;&#1083;&#1086;&#1074;&#1086; &#1080;&#1079; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1075;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; – &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">CS</span>. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;
<span lang="EN-US">RET </span>&#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1085;&#1076;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1088;&#1080;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1077; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1084; &#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1084;&#1091; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089;&#1090;&#1077;&#1082;&#1072;
<span lang="EN-US">SP </span>&#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; (&#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1072; &#1089;&#1090;&#1077;&#1082;&#1072;) 
(&#1089;&#1084;. &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; «5.5. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;&#1086; &#1089;&#1090;&#1077;&#1082;&#1086;&#1084;».</p>
<p class="MsoPlainText">&#1044;&#1088;&#1091;&#1075;&#1080;&#1084; &#1074;&#1080;&#1076;&#1086;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;
<span lang="EN-US">DOS </span>&#1080; <span lang="EN-US">BIOS</span>. &#1055;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086; 
&#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; (&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;
<span lang="EN-US">DOS</span>) &#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;&#1080; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; 
(&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; <span lang="EN-US">BIOS</span>). &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1082; &#1101;&#1090;&#1080;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; 
&#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1072;&#1082; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1080; &#1082; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1072;&#1084;. &#1054;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090; &#1080;&#1093; &#1083;&#1080;&#1096;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072; 
&#1074;&#1099;&#1079;&#1086;&#1074;&#1072;: &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <span lang="EN-US">CALL ProcName</span> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; 
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1090;&#1080;&#1087;&#1072; <span lang="EN-US">INT Number</span>, &#1075;&#1076;&#1077; <span lang="EN-US">Number
</span>– &#1085;&#1086;&#1084;&#1077;&#1088; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <span lang="EN-US">INT</span> 10<span lang="EN-US">h</span>,
<span lang="EN-US">INT</span> 21<span lang="EN-US">h</span> &#1080; &#1090;.&#1087;. &#1069;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; 
&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084; <span lang="EN-US">Number</span> (0&lt;
<span lang="EN-US">Number</span> &lt;255), &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1072;&#1082;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; 
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1074;
<span lang="EN-US">Number</span>-&#1086;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;. 
(&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074; &#1080;&#1079; 256 &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, 
&#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; 0000:0000 &#1080; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1081; &#1076;&#1083;&#1080;&#1085;&#1091; 1024 &#1073;&#1072;&#1081;&#1090;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; 
&#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; 4 &#1073;&#1072;&#1081;&#1090;&#1072; &#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; 
&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;.) &#1047;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1074; &#1089;&#1074;&#1086;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090; 
&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1091;&#1102; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1079;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;
<span lang="EN-US">INT</span>.</p>
<p class="MsoPlainText">&#1042; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; 
&#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088; &#1080; &#1076;&#1083;&#1103; &#1085;&#1080;&#1093; &#1085;&#1077; &#1093;&#1074;&#1072;&#1090;&#1072;&#1077;&#1090; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1093; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1081;, 
&#1086;&#1085;&#1080; (&#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099;) &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1087;&#1086; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1102; &#1089; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080; &#1090;&#1077;&#1084; &#1078;&#1077; 
&#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084;. &#1055;&#1086;&#1076;&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1086;&#1076;&#1085;&#1086;&#1081; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1063;&#1090;&#1086;&#1073;&#1099; 
&#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1077;&#1075;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1074; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088; <span lang="EN-US">AH
</span>&#1079;&#1072;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1085;&#1086;&#1084;&#1077;&#1088; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;:</p>
<p class="a0"><span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">AH</span>,&lt;&#1085;&#1086;&#1084;&#1077;&#1088; 
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;&gt;</p>
<p class="a0"><span lang="EN-US">INT</span>&nbsp; &lt;&#1085;&#1086;&#1084;&#1077;&#1088; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;&gt;</p>
<p class="MsoPlainText">&#1044;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090; 
&#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1083;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1085;&#1072; 
&#1101;&#1082;&#1088;&#1072;&#1085; – &#1082;&#1086;&#1076; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;). &#1058;&#1072;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1099; 
&#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;.</p>
<p class="MsoPlainText">&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; 21<span lang="EN-US">H
</span>&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; 02 &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;.</p>
<p class="a0">...</p>
<p class="a0"><span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">AH</span>,02<span lang="EN-US">h</span>&nbsp;&nbsp; 
;<span lang="EN-US">AH</span> – &#1085;&#1086;&#1084;&#1077;&#1088; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;</p>
<p class="a0"><span lang="EN-US">MOV</span>&nbsp; <span lang="EN-US">DL</span>,’<span lang="EN-US">a</span>’&nbsp;&nbsp; 
;<span lang="EN-US">DL</span> – &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;</p>
<p class="a0"><span lang="EN-US">INT</span>&nbsp; 21<span lang="EN-US">h</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
;&#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;</p>
<p class="a0">...</p>

</body>

</html>
